
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>Apache-Atlas-数据治理 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../FastDCS/FastDCS-introduction.html" />
    
    
    <link rel="prev" href="../zeppelin/zeppelin 中运行 spark streaming kakfa 实时可视化.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    Zeppelin
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../zeppelin/zeppelin Note 运行方式.html">
            
                <a href="../zeppelin/zeppelin Note 运行方式.html">
            
                    
                    zeppelin Note 运行方式
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../zeppelin/zeppelin Note 执行过程.html">
            
                <a href="../zeppelin/zeppelin Note 执行过程.html">
            
                    
                    zeppelin Note 执行过程
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="../zeppelin/zeppelin 中运行 spark streaming kakfa 实时可视化.html">
            
                <a href="../zeppelin/zeppelin 中运行 spark streaming kakfa 实时可视化.html">
            
                    
                    zeppelin 中运行 spark streaming kakfa 实时可视化
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter active" data-level="1.3" data-path="Apache Atlas 数据治理.html">
            
                <a href="Apache Atlas 数据治理.html">
            
                    
                    Apache-Atlas-数据治理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../FastDCS/FastDCS-introduction.html">
            
                <a href="../FastDCS/FastDCS-introduction.html">
            
                    
                    FastDCS-分布式计算系统介绍
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../FastDCS/FastDCS 架构介绍.html">
            
                <a href="../FastDCS/FastDCS 架构介绍.html">
            
                    
                    FastDCS-架构介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../FastDCS/FastDCS 开发实例.html">
            
                <a href="../FastDCS/FastDCS 开发实例.html">
            
                    
                    FastDCS-开发实例
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="../FastDCS/FastDCS 开发说明.html">
            
                <a href="../FastDCS/FastDCS 开发说明.html">
            
                    
                    FastDCS 开发说明
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >Apache-Atlas-数据治理</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="apache-atlas-&#x6570;&#x636E;&#x6CBB;&#x7406;">Apache Atlas &#x6570;&#x636E;&#x6CBB;&#x7406;</h2>
<blockquote>
<p>&#x9762;&#x5BF9;&#x6D77;&#x91CF;&#x4E14;&#x6301;&#x7EED;&#x589E;&#x52A0;&#x7684;&#x5404;&#x5F0F;&#x5404;&#x6837;&#x7684;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#xFF0C;&#x4F60;&#x662F;&#x5426;&#x6709;&#x4FE1;&#x5FC3;&#x77E5;&#x9053;&#x54EA;&#x4E9B;&#x6570;&#x636E;&#x4ECE;&#x54EA;&#x91CC;&#x6765;&#x4EE5;&#x53CA;&#x5B83;&#x5982;&#x4F55;&#x968F;&#x65F6;&#x95F4;&#x800C;&#x53D8;&#x5316;&#xFF1F;&#x91C7;&#x7528;Hadoop&#x5FC5;&#x987B;&#x8003;&#x8651;&#x6570;&#x636E;&#x7BA1;&#x7406;&#x7684;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#xFF0C;&#x5143;&#x6570;&#x636E;&#x4E0E;&#x6570;&#x636E;&#x6CBB;&#x7406;&#x6210;&#x4E3A;&#x4F01;&#x4E1A;&#x7EA7;&#x6570;&#x636E;&#x6E56;&#x7684;&#x91CD;&#x8981;&#x90E8;&#x5206;&#x3002;</p>
<p>&#x4E3A;&#x5BFB;&#x6C42;&#x6570;&#x636E;&#x6CBB;&#x7406;&#x7684;&#x5F00;&#x6E90;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;Hortonworks &#x516C;&#x53F8;&#x8054;&#x5408;&#x5176;&#x4ED6;&#x5382;&#x5546;&#x4E0E;&#x7528;&#x6237;&#x4E8E;2015&#x5E74;&#x53D1;&#x8D77;&#x6570;&#x636E;&#x6CBB;&#x7406;&#x5021;&#x8BAE;&#xFF0C;&#x5305;&#x62EC;&#x6570;&#x636E;&#x5206;&#x7C7B;&#x3001;&#x96C6;&#x4E2D;&#x7B56;&#x7565;&#x5F15;&#x64CE;&#x3001;&#x6570;&#x636E;&#x8840;&#x7F18;&#x3001;&#x5B89;&#x5168;&#x548C;&#x751F;&#x547D;&#x5468;&#x671F;&#x7BA1;&#x7406;&#x7B49;&#x65B9;&#x9762;&#x3002;Apache Atlas &#x9879;&#x76EE;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x5021;&#x8BAE;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x793E;&#x533A;&#x4F19;&#x4F34;&#x6301;&#x7EED;&#x7684;&#x4E3A;&#x8BE5;&#x9879;&#x76EE;&#x63D0;&#x4F9B;&#x65B0;&#x7684;&#x529F;&#x80FD;&#x548C;&#x7279;&#x6027;&#x3002;&#x8BE5;&#x9879;&#x76EE;&#x7528;&#x4E8E;&#x7BA1;&#x7406;&#x5171;&#x4EAB;&#x5143;&#x6570;&#x636E;&#x3001;&#x6570;&#x636E;&#x5206;&#x7EA7;&#x3001;&#x5BA1;&#x8BA1;&#x3001;&#x5B89;&#x5168;&#x6027;&#x4EE5;&#x53CA;&#x6570;&#x636E;&#x4FDD;&#x62A4;&#x7B49;&#x65B9;&#x9762;&#xFF0C;&#x52AA;&#x529B;&#x4E0E;Apache Ranger&#x6574;&#x5408;&#xFF0C;&#x7528;&#x4E8E;&#x6570;&#x636E;&#x6743;&#x9650;&#x63A7;&#x5236;&#x7B56;&#x7565;&#x3002;</p>
</blockquote>
<p>Atlas &#x662F;&#x4E00;&#x4E2A;&#x53EF;&#x6269;&#x5C55;&#x548C;&#x53EF;&#x6269;&#x5C55;&#x7684;&#x6838;&#x5FC3;&#x57FA;&#x7840;&#x6CBB;&#x7406;&#x670D;&#x52A1;&#x96C6; - &#x4F7F;&#x4F01;&#x4E1A;&#x80FD;&#x591F;&#x6709;&#x6548;&#x5730;&#x548C;&#x9AD8;&#x6548;&#x5730;&#x6EE1;&#x8DB3; Hadoop &#x4E2D;&#x7684;&#x5408;&#x89C4;&#x6027;&#x8981;&#x6C42;&#xFF0C;&#x5E76;&#x5141;&#x8BB8;&#x4E0E;&#x6574;&#x4E2A;&#x4F01;&#x4E1A;&#x6570;&#x636E;&#x751F;&#x6001;&#x7CFB;&#x7EDF;&#x7684;&#x96C6;&#x6210;&#x3002;</p>
<p><img src="assets/architecture.png" alt=""></p>
<p>Atlas &#x7684;&#x7EC4;&#x4EF6;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x4EE5;&#x4E0B;&#x4E3B;&#x8981;&#x7C7B;&#x522B;&#xFF1A;</p>
<h2 id="core">Core</h2>
<p>&#x6B64;&#x7C7B;&#x522B;&#x5305;&#x542B;&#x5B9E;&#x73B0; Atlas &#x529F;&#x80FD;&#x6838;&#x5FC3;&#x7684;&#x7EC4;&#x4EF6;&#xFF0C;&#x5305;&#x62EC;&#xFF1A;</p>
<p><strong>Type System</strong>&#xFF1A;Atlas &#x5141;&#x8BB8;&#x7528;&#x6237;&#x4E3A;&#x4ED6;&#x4EEC;&#x60F3;&#x8981;&#x7BA1;&#x7406;&#x7684;&#x5143;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x6A21;&#x578B;&#x3002;&#x8BE5;&#x6A21;&#x578B;&#x7531;&#x79F0;&#x4E3A; &quot;&#x7C7B;&#x578B;&quot; &#x7684;&#x5B9A;&#x4E49;&#x7EC4;&#x6210;&#x3002;&quot;&#x7C7B;&#x578B;&quot; &#x7684; &#x5B9E;&#x4F8B;&#x88AB;&#x79F0;&#x4E3A; &quot;&#x5B9E;&#x4F53;&quot; &#x8868;&#x793A;&#x88AB;&#x7BA1;&#x7406;&#x7684;&#x5B9E;&#x9645;&#x5143;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#x3002;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x662F;&#x4E00;&#x4E2A;&#x7EC4;&#x4EF6;&#xFF0C;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x5B9A;&#x4E49;&#x548C;&#x7BA1;&#x7406;&#x7C7B;&#x578B;&#x548C;&#x5B9E;&#x4F53;&#x3002;&#x7531; Atlas &#x7BA1;&#x7406;&#x7684;&#x6240;&#x6709;&#x5143;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#xFF08;&#x4F8B;&#x5982;Hive&#x8868;&#xFF09;&#x90FD;&#x4F7F;&#x7528;&#x7C7B;&#x578B;&#x8FDB;&#x884C;&#x5EFA;&#x6A21;&#xFF0C;&#x5E76;&#x8868;&#x793A;&#x4E3A;&#x5B9E;&#x4F53;&#x3002;&#x8981;&#x5728; Atlas &#x4E2D;&#x5B58;&#x50A8;&#x65B0;&#x7C7B;&#x578B;&#x7684;&#x5143;&#x6570;&#x636E;&#xFF0C;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x7EC4;&#x4EF6;&#x7684;&#x6982;&#x5FF5;&#x3002;</p>
<p>&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x70B9;&#x662F;&#xFF0C;Atlas &#x4E2D;&#x5EFA;&#x6A21;&#x7684;&#x901A;&#x7528;&#x6027;&#x8D28;&#x5141;&#x8BB8;&#x6570;&#x636E;&#x7BA1;&#x7406;&#x5458;&#x548C;&#x96C6;&#x6210;&#x8005;&#x5B9A;&#x4E49;&#x6280;&#x672F;&#x5143;&#x6570;&#x636E;&#x548C;&#x4E1A;&#x52A1;&#x5143;&#x6570;&#x636E;&#x3002;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; Atlas &#x7684;&#x7279;&#x5F81;&#x6765;&#x5B9A;&#x4E49;&#x4E24;&#x8005;&#x4E4B;&#x95F4;&#x7684;&#x4E30;&#x5BCC;&#x5173;&#x7CFB;&#x3002;</p>
<p><strong>Ingest / Export</strong>&#xFF1A;Ingest &#x7EC4;&#x4EF6;&#x5141;&#x8BB8;&#x5C06;&#x5143;&#x6570;&#x636E;&#x6DFB;&#x52A0;&#x5230; Atlas&#x3002;&#x7C7B;&#x4F3C;&#x5730;&#xFF0C;Export &#x7EC4;&#x4EF6;&#x66B4;&#x9732;&#x7531; Atlas &#x68C0;&#x6D4B;&#x5230;&#x7684;&#x5143;&#x6570;&#x636E;&#x66F4;&#x6539;&#xFF0C;&#x4EE5;&#x4F5C;&#x4E3A;&#x4E8B;&#x4EF6;&#x5F15;&#x53D1;&#xFF0C;&#x6D88;&#x8D39;&#x8005;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x66F4;&#x6539;&#x4E8B;&#x4EF6;&#x6765;&#x5B9E;&#x65F6;&#x54CD;&#x5E94;&#x5143;&#x6570;&#x636E;&#x66F4;&#x6539;&#x3002;</p>
<p><strong>Graph Engine</strong> &#xFF1A;&#x5728;&#x5185;&#x90E8;&#xFF0C;Atlas &#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x56FE;&#x5F62;&#x6A21;&#x578B;&#x7BA1;&#x7406;&#x5143;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#x3002;&#x4EE5;&#x5B9E;&#x73B0;&#x5143;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#x4E4B;&#x95F4;&#x7684;&#x5DE8;&#x5927;&#x7075;&#x6D3B;&#x6027;&#x548C;&#x4E30;&#x5BCC;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x56FE;&#x5F62;&#x5F15;&#x64CE;&#x662F;&#x8D1F;&#x8D23;&#x5728;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x7684;&#x7C7B;&#x578B;&#x548C;&#x5B9E;&#x4F53;&#x4E4B;&#x95F4;&#x8FDB;&#x884C;&#x8F6C;&#x6362;&#x7684;&#x7EC4;&#x4EF6;&#xFF0C;&#x4EE5;&#x53CA;&#x57FA;&#x7840;&#x56FE;&#x5F62;&#x6A21;&#x578B;&#x3002;&#x9664;&#x4E86;&#x7BA1;&#x7406;&#x56FE;&#x5F62;&#x5BF9;&#x8C61;&#x4E4B;&#x5916;&#xFF0C;&#x56FE;&#x5F62;&#x5F15;&#x64CE;&#x8FD8;&#x4E3A;&#x5143;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#x521B;&#x5EFA;&#x9002;&#x5F53;&#x7684;&#x7D22;&#x5F15;&#xFF0C;&#x4EE5;&#x4FBF;&#x6709;&#x6548;&#x5730;&#x641C;&#x7D22;&#x5B83;&#x4EEC;&#x3002;</p>
<p><strong>Titan</strong>&#xFF1A;&#x76EE;&#x524D;&#xFF0C;Atlas &#x4F7F;&#x7528; Titan &#x56FE;&#x6570;&#x636E;&#x5E93;&#x6765;&#x5B58;&#x50A8;&#x5143;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#x3002; Titan &#x4F7F;&#x7528;&#x4E24;&#x4E2A;&#x5B58;&#x50A8;&#xFF1A;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#x5143;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x914D;&#x7F6E;&#x4E3A; HBase &#xFF0C;&#x7D22;&#x5F15;&#x5B58;&#x50A8;&#x914D;&#x7F6E;&#x4E3A; Solr&#x3002;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6784;&#x5EFA;&#x76F8;&#x5E94;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x5C06;&#x5143;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x4F5C;&#x4E3A; BerkeleyDB &#x548C; Index &#x5B58;&#x50A8;&#x4F7F;&#x7528;&#x4E3A; ElasticSearch&#x3002;&#x5143;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x5143;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#x672C;&#x8EAB;&#xFF0C;&#x5E76;&#x4E14;&#x7D22;&#x5F15;&#x5B58;&#x50A8;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x5143;&#x6570;&#x636E;&#x5C5E;&#x6027;&#x7684;&#x7D22;&#x5F15;&#xFF0C;&#x5176;&#x5141;&#x8BB8;&#x9AD8;&#x6548;&#x641C;&#x7D22;&#x3002;</p>
<h2 id="integration">Integration</h2>
<p>&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#x7BA1;&#x7406; Atlas &#x4E2D;&#x7684;&#x5143;&#x6570;&#x636E;&#xFF1A;</p>
<p><strong>API</strong>&#xFF1A;Atlas &#x7684;&#x6240;&#x6709;&#x529F;&#x80FD;&#x901A;&#x8FC7; REST API &#x63D0;&#x4F9B;&#x7ED9;&#x6700;&#x7EC8;&#x7528;&#x6237;&#xFF0C;&#x5141;&#x8BB8;&#x521B;&#x5EFA;&#xFF0C;&#x66F4;&#x65B0;&#x548C;&#x5220;&#x9664;&#x7C7B;&#x578B;&#x548C;&#x5B9E;&#x4F53;&#x3002;&#x5B83;&#x4E5F;&#x662F;&#x67E5;&#x8BE2;&#x548C;&#x53D1;&#x73B0;&#x901A;&#x8FC7; Atlas &#x7BA1;&#x7406;&#x7684;&#x7C7B;&#x578B;&#x548C;&#x5B9E;&#x4F53;&#x7684;&#x4E3B;&#x8981;&#x65B9;&#x6CD5;&#x3002;</p>
<p><strong>Messaging</strong>&#xFF1A;&#x9664;&#x4E86; API &#x4E4B;&#x5916;&#xFF0C;&#x7528;&#x6237;&#x8FD8;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x4F7F;&#x7528;&#x57FA;&#x4E8E; Kafka &#x7684;&#x6D88;&#x606F;&#x63A5;&#x53E3;&#x4E0E; Atlas &#x96C6;&#x6210;&#x3002;&#x8FD9;&#x5BF9;&#x4E8E;&#x5C06;&#x5143;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#x4F20;&#x8F93;&#x5230; Atlas &#x4EE5;&#x53CA;&#x4ECE; Atlas &#x4F7F;&#x7528;&#x53EF;&#x4EE5;&#x6784;&#x5EFA;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5143;&#x6570;&#x636E;&#x66F4;&#x6539;&#x4E8B;&#x4EF6;&#x90FD;&#x975E;&#x5E38;&#x6709;&#x7528;&#x3002;&#x5982;&#x679C;&#x5E0C;&#x671B;&#x4F7F;&#x7528;&#x4E0E; Atlas &#x66F4;&#x677E;&#x6563;&#x8026;&#x5408;&#x7684;&#x96C6;&#x6210;&#xFF0C;&#x8FD9;&#x53EF;&#x4EE5;&#x5141;&#x8BB8;&#x66F4;&#x597D;&#x7684;&#x53EF;&#x6269;&#x5C55;&#x6027;&#xFF0C;&#x53EF;&#x9760;&#x6027;&#x7B49;&#xFF0C;&#x6D88;&#x606F;&#x4F20;&#x9012;&#x63A5;&#x53E3;&#x662F;&#x7279;&#x522B;&#x6709;&#x7528;&#x7684;&#x3002;Atlas &#x4F7F;&#x7528; Apache Kafka &#x4F5C;&#x4E3A;&#x901A;&#x77E5;&#x670D;&#x52A1;&#x5668;&#x7528;&#x4E8E;&#x94A9;&#x5B50;&#x548C;&#x5143;&#x6570;&#x636E;&#x901A;&#x77E5;&#x4E8B;&#x4EF6;&#x7684;&#x4E0B;&#x6E38;&#x6D88;&#x8D39;&#x8005;&#x4E4B;&#x95F4;&#x7684;&#x901A;&#x4FE1;&#x3002;&#x4E8B;&#x4EF6;&#x7531;&#x94A9;&#x5B50;&#x548C; Atlas &#x5199;&#x5230;&#x4E0D;&#x540C;&#x7684; Kafka &#x4E3B;&#x9898;&#x3002;</p>
<h3 id="&#x5143;&#x6570;&#x636E;&#x6E90;">&#x5143;&#x6570;&#x636E;&#x6E90;</h3>
<p>Atlas &#x652F;&#x6301;&#x4E0E;&#x8BB8;&#x591A;&#x5143;&#x6570;&#x636E;&#x6E90;&#x7684;&#x96C6;&#x6210;&#x3002;&#x5C06;&#x6765;&#x8FD8;&#x4F1A;&#x6DFB;&#x52A0;&#x66F4;&#x591A;&#x96C6;&#x6210;&#x3002;&#x76EE;&#x524D;&#xFF0C;Atlas &#x652F;&#x6301;&#x4ECE;&#x4EE5;&#x4E0B;&#x6765;&#x6E90;&#x83B7;&#x53D6;&#x548C;&#x7BA1;&#x7406;&#x5143;&#x6570;&#x636E;&#xFF1A;</p>
<ul>
<li><a href="http://atlas.incubator.apache.org/Bridge-Hive.html" target="_blank">Hive</a></li>
<li><a href="http://atlas.incubator.apache.org/Bridge-Sqoop.html" target="_blank">Sqoop</a></li>
<li><a href="http://atlas.incubator.apache.org/Bridge-Falcon.html" target="_blank">Falcon</a></li>
<li><a href="http://atlas.incubator.apache.org/StormAtlasHook.html" target="_blank">Storm</a></li>
</ul>
<p>&#x4E0E;&#x5176;&#x5B83;&#x5143;&#x6570;&#x636E;&#x6E90;&#x96C6;&#x6210;&#x610F;&#x5473;&#x7740;&#x4E24;&#x4EF6;&#x4E8B;&#xFF1A;&#x6709;&#x4E00;&#x4E9B;&#x5143;&#x6570;&#x636E;&#x6A21;&#x578B;&#xFF0C;Atlas &#x5B9A;&#x4E49;&#x672C;&#x673A;&#x6765;&#x8868;&#x793A;&#x8FD9;&#x4E9B;&#x7EC4;&#x4EF6;&#x7684;&#x5BF9;&#x8C61;&#x3002; Atlas &#x63D0;&#x4F9B;&#x4E86;&#x4ECE;&#x8FD9;&#x4E9B;&#x7EC4;&#x4EF6;&#x4E2D;&#x901A;&#x8FC7;&#x5B9E;&#x65F6;&#x6216;&#x6279;&#x5904;&#x7406;&#x6A21;&#x5F0F;&#x83B7;&#x53D6;&#x5143;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#x7684;&#x7EC4;&#x4EF6;&#x3002;</p>
<h2 id="apps">Apps</h2>
<p>&#x7531; Atlas &#x7BA1;&#x7406;&#x7684;&#x5143;&#x6570;&#x636E;&#x5404;&#x79CD;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F7F;&#x7528;&#xFF0C;&#x6EE1;&#x8DB3;&#x8BB8;&#x591A;&#x6CBB;&#x7406;&#x7528;&#x4F8B;&#x3002;</p>
<p><strong>Atlas Admin UI</strong>&#xFF1A;&#x8BE5;&#x7EC4;&#x4EF6;&#x662F;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E; Web &#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x5141;&#x8BB8;&#x6570;&#x636E;&#x7BA1;&#x7406;&#x5458;&#x548C;&#x79D1;&#x5B66;&#x5BB6;&#x53D1;&#x73B0;&#x548C;&#x6CE8;&#x91CA;&#x5143;&#x6570;&#x636E;&#x3002;&#x8FD9;&#x91CC;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#x641C;&#x7D22;&#x754C;&#x9762;&#x548C; SQL &#x6837;&#x7684;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x67E5;&#x8BE2;&#x7531; Atlas &#x7BA1;&#x7406;&#x7684;&#x5143;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x548C;&#x5BF9;&#x8C61;&#x3002;&#x7BA1;&#x7406; UI &#x4F7F;&#x7528; Atlas &#x7684; REST API &#x6765;&#x6784;&#x5EFA;&#x5176;&#x529F;&#x80FD;&#x3002;</p>
<p><strong>Tag Based Policies</strong>&#xFF1A;Apache Ranger &#x662F;&#x9488;&#x5BF9; Hadoop &#x751F;&#x6001;&#x7CFB;&#x7EDF;&#x7684;&#x9AD8;&#x7EA7;&#x5B89;&#x5168;&#x7BA1;&#x7406;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x4E0E;&#x5404;&#x79CD; Hadoop &#x7EC4;&#x4EF6;&#x5177;&#x6709;&#x5E7F;&#x6CDB;&#x7684;&#x96C6;&#x6210;&#x3002;&#x901A;&#x8FC7;&#x4E0E; Atlas &#x96C6;&#x6210;&#xFF0C;Ranger &#x5141;&#x8BB8;&#x5B89;&#x5168;&#x7BA1;&#x7406;&#x5458;&#x5B9A;&#x4E49;&#x5143;&#x6570;&#x636E;&#x9A71;&#x52A8;&#x7684;&#x5B89;&#x5168;&#x7B56;&#x7565;&#xFF0C;&#x4EE5;&#x5B9E;&#x73B0;&#x6709;&#x6548;&#x7684;&#x6CBB;&#x7406;&#x3002; Ranger &#x662F;&#x7531; Atlas &#x901A;&#x77E5;&#x7684;&#x5143;&#x6570;&#x636E;&#x66F4;&#x6539;&#x4E8B;&#x4EF6;&#x7684;&#x6D88;&#x8D39;&#x8005;&#x3002;</p>
<p><strong>Business Taxonomy</strong>&#xFF1A;&#x4ECE;&#x5143;&#x6570;&#x636E;&#x6E90;&#x83B7;&#x53D6;&#x5230; Atlas &#x7684;&#x5143;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#x4E3B;&#x8981;&#x662F;&#x4E00;&#x79CD;&#x6280;&#x672F;&#x5F62;&#x5F0F;&#x7684;&#x5143;&#x6570;&#x636E;&#x3002;&#x4E3A;&#x4E86;&#x589E;&#x5F3A;&#x53EF;&#x53D1;&#x73B0;&#x6027;&#x548C;&#x6CBB;&#x7406;&#x80FD;&#x529B;&#xFF0C;Atlas &#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x4E1A;&#x52A1;&#x5206;&#x7C7B;&#x754C;&#x9762;&#xFF0C;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x9996;&#x5148;&#x5B9A;&#x4E49;&#x4E00;&#x7EC4;&#x4EE3;&#x8868;&#x5176;&#x4E1A;&#x52A1;&#x57DF;&#x7684;&#x4E1A;&#x52A1;&#x672F;&#x8BED;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x4E0E; Atlas &#x7BA1;&#x7406;&#x7684;&#x5143;&#x6570;&#x636E;&#x5B9E;&#x4F53;&#x76F8;&#x5173;&#x8054;&#x3002;&#x4E1A;&#x52A1;&#x5206;&#x7C7B;&#x6CD5;&#x662F;&#x4E00;&#x79CD; Web &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x76EE;&#x524D;&#x662F; Atlas Admin UI &#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x5E76;&#x4E14;&#x4F7F;&#x7528; REST API &#x4E0E; Atlas &#x96C6;&#x6210;&#x3002;</p>
<h2 id="type-system">Type System</h2>
<h3 id="overview">Overview</h3>
<p>Atlas &#x5141;&#x8BB8;&#x7528;&#x6237;&#x4E3A;&#x4ED6;&#x4EEC;&#x60F3;&#x8981;&#x7BA1;&#x7406;&#x7684;&#x5143;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x6A21;&#x578B;&#x3002;&#x8BE5;&#x6A21;&#x578B;&#x7531;&#x79F0;&#x4E3A; &quot;&#x7C7B;&#x578B;&quot; &#x7684;&#x5B9A;&#x4E49;&#x7EC4;&#x6210;&#x3002;&#x88AB;&#x79F0;&#x4E3A; &quot;&#x5B9E;&#x4F53;&quot; &#x7684; &quot;&#x7C7B;&#x578B;&quot; &#x5B9E;&#x4F8B;&#x8868;&#x793A;&#x88AB;&#x7BA1;&#x7406;&#x7684;&#x5B9E;&#x9645;&#x5143;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#x3002;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x662F;&#x4E00;&#x4E2A;&#x7EC4;&#x4EF6;&#xFF0C;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x5B9A;&#x4E49;&#x548C;&#x7BA1;&#x7406;&#x7C7B;&#x578B;&#x548C;&#x5B9E;&#x4F53;&#x3002;&#x7531; Atlas &#x7BA1;&#x7406;&#x7684;&#x6240;&#x6709;&#x5143;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#xFF08;&#x4F8B;&#x5982;Hive&#x8868;&#xFF09;&#x90FD;&#x4F7F;&#x7528;&#x7C7B;&#x578B;&#x8FDB;&#x884C;&#x5EFA;&#x6A21;&#xFF0C;&#x5E76;&#x8868;&#x793A;&#x4E3A;&#x5B9E;&#x4F53;&#x3002;&#x8981;&#x5728;Atlas&#x4E2D;&#x5B58;&#x50A8;&#x65B0;&#x7C7B;&#x578B;&#x7684;&#x5143;&#x6570;&#x636E;&#xFF0C;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x7EC4;&#x4EF6;&#x7684;&#x6982;&#x5FF5;&#x3002;</p>
<h3 id="types">Types</h3>
<p>Atlas&#x4E2D;&#x7684; &quot;&#x7C7B;&#x578B;&quot; &#x5B9A;&#x4E49;&#x4E86;&#x5982;&#x4F55;&#x5B58;&#x50A8;&#x548C;&#x8BBF;&#x95EE;&#x7279;&#x5B9A;&#x7C7B;&#x578B;&#x7684;&#x5143;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#x3002;&#x7C7B;&#x578B;&#x8868;&#x793A;&#x4E86;&#x6240;&#x5B9A;&#x4E49;&#x5143;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#x7684;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x5C5E;&#x6027;&#x96C6;&#x5408;&#x3002;&#x5177;&#x6709;&#x5F00;&#x53D1;&#x80CC;&#x666F;&#x7684;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x5C06; &quot;&#x7C7B;&#x578B;&quot; &#x7406;&#x89E3;&#x6210;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684; &quot;&#x7C7B;&quot; &#x5B9A;&#x4E49;&#x7684;&#x6216;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x7684; &quot;&#x8868;&#x6A21;&#x5F0F;&quot;&#x3002;</p>
<p>&#x4E0E; Atlas &#x672C;&#x5730;&#x5B9A;&#x4E49;&#x7684;&#x7C7B;&#x578B;&#x7684;&#x793A;&#x4F8B;&#x662F; Hive &#x8868;&#x3002; Hive &#x8868;&#x7528;&#x8FD9;&#x4E9B;&#x5C5E;&#x6027;&#x5B9A;&#x4E49;&#xFF1A;</p>
<pre><code class="lang-java">Name: hive_table
MetaType: Class
SuperTypes: DataSet
Attributes:
    name: String (name of the table)
    db: Database object of type hive_db
    owner: String
    createTime: Date
    lastAccessTime: Date
    comment: String
    retention: <span class="hljs-keyword">int</span>
    sd: Storage Description object of type hive_storagedesc
    partitionKeys: Array of objects of type hive_column
    aliases: Array of strings
    columns: Array of objects of type hive_column
    parameters: Map of String keys to String values
    viewOriginalText: String
    viewExpandedText: String
    tableType: String
    temporary: Boolean
</code></pre>
<p>&#x4ECE;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x53EF;&#x4EE5;&#x6CE8;&#x610F;&#x5230;&#x4EE5;&#x4E0B;&#x51E0;&#x70B9;&#xFF1A;</p>
<ul>
<li>Atlas&#x4E2D;&#x7684;&#x7C7B;&#x578B;&#x7531; &quot;name&quot; &#x552F;&#x4E00;&#x6807;&#x8BC6;&#xFF0C;</li>
<li>&#x7C7B;&#x578B;&#x5177;&#x6709;&#x5143;&#x7C7B;&#x578B;&#x3002;&#x5143;&#x7C7B;&#x578B;&#x8868;&#x793A; Atlas &#x4E2D;&#x6B64;&#x6A21;&#x578B;&#x7684;&#x7C7B;&#x578B;&#x3002; Atlas &#x6709;&#x4EE5;&#x4E0B;&#x51E0;&#x79CD;&#x7C7B;&#x578B;&#xFF1A;<ul>
<li>&#x57FA;&#x672C;&#x5143;&#x7C7B;&#x578B;&#xFF1A; Int&#xFF0C;String&#xFF0C;Boolean&#x7B49;&#x3002;</li>
<li>&#x679A;&#x4E3E;&#x5143;&#x7C7B;&#x578B;</li>
<li>&#x96C6;&#x5408;&#x5143;&#x7C7B;&#x578B;&#xFF1A;&#x4F8B;&#x5982;Array&#xFF0C;Map</li>
<li>&#x590D;&#x5408;&#x5143;&#x7C7B;&#x578B;&#xFF1A;Class&#xFF0C;Struct&#xFF0C;Trait</li>
</ul>
</li>
<li>&#x7C7B;&#x578B;&#x53EF;&#x4EE5;&#x4ECE;&#x79F0;&#x4E3A; &quot;supertype&quot; &#x7684;&#x7236;&#x7C7B;&#x578B; &quot;extend&quot; - &#x51ED;&#x501F;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x5B83;&#x5C06;&#x5305;&#x542B;&#x5728; &quot;supertype&quot; &#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x5C5E;&#x6027;&#x3002;&#x8FD9;&#x5141;&#x8BB8;&#x6A21;&#x578B;&#x5728;&#x4E00;&#x7EC4;&#x76F8;&#x5173;&#x7C7B;&#x578B;&#x7B49;&#x4E4B;&#x95F4;&#x5B9A;&#x4E49;&#x516C;&#x5171;&#x5C5E;&#x6027;&#x3002;&#x8FD9;&#x518D;&#x6B21;&#x7C7B;&#x4F3C;&#x4E8E;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BED;&#x8A00;&#x5982;&#x4F55;&#x5B9A;&#x4E49;&#x7C7B;&#x7684;&#x8D85;&#x7C7B;&#x7684;&#x6982;&#x5FF5;&#x3002; Atlas &#x4E2D;&#x7684;&#x7C7B;&#x578B;&#x4E5F;&#x53EF;&#x4EE5;&#x4ECE;&#x591A;&#x4E2A;&#x8D85;&#x7C7B;&#x578B;&#x6269;&#x5C55;&#x3002;<ul>
<li>&#x5728;&#x8BE5;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A; hive &#x8868;&#x4ECE;&#x9884;&#x5B9A;&#x4E49;&#x7684;&#x8D85;&#x7C7B;&#x578B;&#xFF08;&#x79F0;&#x4E3A; &quot;DataSet&quot;&#xFF09;&#x6269;&#x5C55;&#x3002;&#x7A0D;&#x540E;&#x5C06;&#x63D0;&#x4F9B;&#x5173;&#x4E8E;&#x6B64;&#x9884;&#x5B9A;&#x4E49;&#x7C7B;&#x578B;&#x7684;&#x66F4;&#x591A;&#x7EC6;&#x8282;&#x3002;</li>
</ul>
</li>
<li>&#x5177;&#x6709; &quot;Class&quot;&#xFF0C;&quot;Struct&quot; &#x6216; &quot;Trait&quot; &#x7684;&#x5143;&#x7C7B;&#x578B;&#x7684;&#x7C7B;&#x578B;&#x53EF;&#x4EE5;&#x5177;&#x6709;&#x5C5E;&#x6027;&#x96C6;&#x5408;&#x3002;&#x6BCF;&#x4E2A;&#x5C5E;&#x6027;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x540D;&#x79F0;&#xFF08;&#x4F8B;&#x5982; &quot;name&quot;&#xFF09;&#x548C;&#x4E00;&#x4E9B;&#x5176;&#x4ED6;&#x5173;&#x8054;&#x7684;&#x5C5E;&#x6027;&#x3002;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8868;&#x8FBE;&#x5F0F; type_name.attribute_name &#x6765;&#x5F15;&#x7528;&#x5C5E;&#x6027;&#x3002;&#x8FD8;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x5C5E;&#x6027;&#x672C;&#x8EAB;&#x662F;&#x4F7F;&#x7528; Atlas &#x5143;&#x7C7B;&#x578B;&#x5B9A;&#x4E49;&#x7684;&#x3002;<ul>
<li>&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;hive_table.name &#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;hive_table.aliases &#x662F;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x6570;&#x7EC4;&#xFF0C;hive_table.db &#x5F15;&#x7528;&#x4E00;&#x4E2A;&#x7C7B;&#x578B;&#x7684;&#x5B9E;&#x4F8B;&#x79F0;&#x4E3A; hive_db &#x7B49;&#x7B49;&#x3002;</li>
</ul>
</li>
<li>&#x5728;&#x5C5E;&#x6027;&#x4E2D;&#x952E;&#x5165;&#x5F15;&#x7528;&#xFF08;&#x5982;hive_table.db&#xFF09;&#x3002;&#x4F7F;&#x7528;&#x8FD9;&#x6837;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728; Atlas &#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x4E24;&#x79CD;&#x7C7B;&#x578B;&#x4E4B;&#x95F4;&#x7684;&#x4EFB;&#x610F;&#x5173;&#x7CFB;&#xFF0C;&#x4ECE;&#x800C;&#x6784;&#x5EFA;&#x4E30;&#x5BCC;&#x7684;&#x6A21;&#x578B;&#x3002;&#x6CE8;&#x610F;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x6536;&#x96C6;&#x4E00;&#x4E2A;&#x5F15;&#x7528;&#x5217;&#x8868;&#x4F5C;&#x4E3A;&#x5C5E;&#x6027;&#x7C7B;&#x578B;&#xFF08;&#x4F8B;&#x5982; hive_table.cols&#xFF0C;&#x5B83;&#x8868;&#x793A;&#x4ECE; hive_table &#x5230; hive_column &#x7C7B;&#x578B;&#x7684;&#x5F15;&#x7528;&#x5217;&#x8868;&#xFF09;</li>
</ul>
<h3 id="entities">Entities</h3>
<p>Atlas&#x4E2D;&#x7684; &quot;&#x5B9E;&#x4F53;&quot; &#x662F;&#x7C7B; &quot;&#x7C7B;&#x578B;&quot; &#x7684;&#x7279;&#x5B9A;&#x503C;&#x6216;&#x5B9E;&#x4F8B;&#xFF0C;&#x56E0;&#x6B64;&#x8868;&#x793A;&#x771F;&#x5B9E;&#x4E16;&#x754C;&#x4E2D;&#x7684;&#x7279;&#x5B9A;&#x5143;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#x3002; &#x56DE;&#x987E;&#x6211;&#x4EEC;&#x7684;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684;&#x7C7B;&#x6BD4;&#xFF0C;&quot;&#x5B9E;&#x4F8B;&quot; &#x662F;&#x67D0;&#x4E2A; &quot;&#x7C7B;&quot; &#x7684; &quot;&#x5BF9;&#x8C61;&quot;&#x3002;</p>
<p>&#x5B9E;&#x4F53;&#x7684;&#x793A;&#x4F8B;&#x5C06;&#x662F;&#x7279;&#x5B9A;&#x7684; Hive &#x8868;&#x3002; &#x8BF4; &quot;Hive&quot; &#x5728; &quot;&#x9ED8;&#x8BA4;&quot; &#x6570;&#x636E;&#x5E93;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;&#x540D;&#x4E3A; &quot;customers&quot; &#x7684;&#x8868;&#x3002; &#x6B64;&#x8868;&#x5C06;&#x662F;&#x7C7B;&#x578B;&#x4E3A; hive_table &#x7684; Atlas &#x4E2D;&#x7684; &quot;&#x5B9E;&#x4F53;&quot;&#x3002; &#x901A;&#x8FC7;&#x4F5C;&#x4E3A;&#x7C7B;&#x7C7B;&#x578B;&#x7684;&#x5B9E;&#x4F8B;&#xFF0C;&#x5B83;&#x5C06;&#x5177;&#x6709;&#x4F5C;&#x4E3A; Hive &#x8868; &quot;&#x7C7B;&#x578B;&quot; &#x7684;&#x4E00;&#x90E8;&#x5206;&#x7684;&#x6BCF;&#x4E2A;&#x5C5E;&#x6027;&#x7684;&#x503C;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p>
<pre><code>id: &quot;9ba387dd-fa76-429c-b791-ffc338d3c91f&quot;
typeName: &#x201C;hive_table&#x201D;
values:
    name: &quot;customers&quot;
    db: &quot;b42c6cfc-c1e7-42fd-a9e6-890e0adf33bc&quot;
    owner: &quot;admin&quot;
    createTime: &quot;2016-06-20T06:13:28.000Z&quot;
    lastAccessTime: &quot;2016-06-20T06:13:28.000Z&quot;
    comment: null
    retention: 0
    sd: &quot;ff58025f-6854-4195-9f75-3a3058dd8dcf&quot;
    partitionKeys: null
    aliases: null
    columns: [&quot;65e2204f-6a23-4130-934a-9679af6a211f&quot;, &quot;d726de70-faca-46fb-9c99-cf04f6b579a6&quot;, ...]
    parameters: {&quot;transient_lastDdlTime&quot;: &quot;1466403208&quot;}
    viewOriginalText: null
    viewExpandedText: null
    tableType: &quot;MANAGED_TABLE&quot;
    temporary: false
</code></pre><p>&#x4ECE;&#x4E0A;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x53EF;&#x4EE5;&#x6CE8;&#x610F;&#x5230;&#x4EE5;&#x4E0B;&#x51E0;&#x70B9;&#xFF1A;</p>
<ul>
<li>&#x4F5C;&#x4E3A; Class Type &#x5B9E;&#x4F8B;&#x7684;&#x6BCF;&#x4E2A;&#x5B9E;&#x4F53;&#x90FD;&#x7531;&#x552F;&#x4E00;&#x6807;&#x8BC6;&#x7B26; GUID &#x6807;&#x8BC6;&#x3002;&#x6B64; GUID &#x7531; Atlas &#x670D;&#x52A1;&#x5668;&#x5728;&#x5B9A;&#x4E49;&#x5BF9;&#x8C61;&#x65F6;&#x751F;&#x6210;&#xFF0C;&#x5E76;&#x5728;&#x5B9E;&#x4F53;&#x7684;&#x6574;&#x4E2A;&#x751F;&#x547D;&#x5468;&#x671F;&#x5185;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#x3002;&#x5728;&#x4EFB;&#x4F55;&#x65F6;&#x95F4;&#x70B9;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5176; GUID &#x6765;&#x8BBF;&#x95EE;&#x8BE5;&#x7279;&#x5B9A;&#x5B9E;&#x4F53;&#x3002;<ul>
<li>&#x5728;&#x672C;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x9ED8;&#x8BA4;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684; &quot;customers&quot; &#x8868;&#x7531;GUID &quot;9ba387dd-fa76-429c-b791-ffc338d3c91f&quot; &#x552F;&#x4E00;&#x6807;&#x8BC6;</li>
</ul>
</li>
<li>&#x5B9E;&#x4F53;&#x5177;&#x6709;&#x7ED9;&#x5B9A;&#x7C7B;&#x578B;&#xFF0C;&#x5E76;&#x4E14;&#x7C7B;&#x578B;&#x7684;&#x540D;&#x79F0;&#x4E0E;&#x5B9E;&#x4F53;&#x5B9A;&#x4E49;&#x4E00;&#x8D77;&#x63D0;&#x4F9B;&#x3002;<ul>
<li>&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&quot;customers&quot; &#x8868;&#x662F;&#x4E00;&#x4E2A; &quot;hive_table&quot;&#x3002;</li>
</ul>
</li>
<li>&#x6B64;&#x5B9E;&#x4F53;&#x7684;&#x503C;&#x662F;&#x6240;&#x6709;&#x5C5E;&#x6027;&#x540D;&#x79F0;&#x53CA;&#x5176;&#x5728; hive_table &#x7C7B;&#x578B;&#x5B9A;&#x4E49;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x5C5E;&#x6027;&#x7684;&#x503C;&#x7684;&#x6620;&#x5C04;&#x3002;</li>
<li>&#x5C5E;&#x6027;&#x503C;&#x5C06;&#x6839;&#x636E;&#x5C5E;&#x6027;&#x7684;&#x5143;&#x7C7B;&#x578B;&#x3002;<ul>
<li>&#x57FA;&#x672C;&#x5143;&#x7C7B;&#x578B;&#xFF1A;&#x6574;&#x6570;&#xFF0C;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x5E03;&#x5C14;&#x503C;&#x3002;&#x4F8B;&#x5982;&#x3002; &apos;name&apos;=&apos;customers&apos;&#xFF0C;&apos;Temporary&apos;=&apos;false&apos;</li>
<li>&#x96C6;&#x5408;&#x5143;&#x7C7B;&#x578B;&#xFF1A;&#x5305;&#x542B;&#x5143;&#x7C7B;&#x578B;&#x7684;&#x503C;&#x7684;&#x6570;&#x7EC4;&#x6216;&#x6620;&#x5C04;&#x3002;&#x4F8B;&#x5982;&#x3002; parameters = {&quot;transient_lastDdlTime&quot;&#xFF1A;&quot;1466403208&quot;}</li>
<li>&#x590D;&#x5408;&#x5143;&#x7C7B;&#x578B;&#xFF1A;&#x5BF9;&#x4E8E;&#x7C7B;&#xFF0C;&#x503C;&#x5C06;&#x662F;&#x4E0E;&#x8BE5;&#x7279;&#x5B9A;&#x5B9E;&#x4F53;&#x5177;&#x6709;&#x5173;&#x7CFB;&#x7684;&#x5B9E;&#x4F53;&#x3002;&#x4F8B;&#x5982;&#x3002;hive &#x8868; &quot;customers&quot; &#x5B58;&#x5728;&#x4E8E;&#x79F0;&#x4E3A; &quot;default&quot; &#x7684;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x3002;</li>
</ul>
</li>
</ul>
<p>&#x8868;&#x548C;&#x6570;&#x636E;&#x5E93;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x901A;&#x8FC7; &quot;db&quot; &#x5C5E;&#x6027;&#x6355;&#x83B7;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&quot;db&quot; &#x5C5E;&#x6027;&#x7684;&#x503C;&#x5C06;&#x662F;&#x4E00;&#x4E2A;&#x552F;&#x4E00;&#x6807;&#x8BC6; hive_db &#x5B9E;&#x4F53;&#x7684; GUID&#xFF0C;&#x79F0;&#x4E3A; &quot;default&quot;
&#x5BF9;&#x4E8E;&#x5B9E;&#x4F53;&#x7684;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#xFF0C;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x770B;&#x5230; Class &#x548C; Struct &#x5143;&#x7C7B;&#x578B;&#x4E4B;&#x95F4;&#x7684;&#x533A;&#x522B;&#x3002;&#x7C7B;&#x548C;&#x7ED3;&#x6784;&#x4F53;&#x90FD;&#x7EC4;&#x6210;&#x5176;&#x4ED6;&#x7C7B;&#x578B;&#x7684;&#x5C5E;&#x6027;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x7C7B;&#x7C7B;&#x578B;&#x7684;&#x5B9E;&#x4F53;&#x5177;&#x6709; Id &#x5C5E;&#x6027;&#xFF08;&#x5177;&#x6709;GUID&#x503C;&#xFF09;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x4ECE;&#x5176;&#x4ED6;&#x5B9E;&#x4F53;&#x5F15;&#x7528;&#xFF08;&#x5982; hive_db &#x5B9E;&#x4F53;&#x4ECE; hive_table &#x5B9E;&#x4F53;&#x5F15;&#x7528;&#xFF09;&#x3002; Struct &#x7C7B;&#x578B;&#x7684;&#x5B9E;&#x4F8B;&#x6CA1;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x8EAB;&#x4EFD;&#xFF0C;Struct &#x7C7B;&#x578B;&#x7684;&#x503C;&#x662F;&#x5728;&#x5B9E;&#x4F53;&#x672C;&#x8EAB;&#x5185;&#x5D4C;&#x5165;&#x7684;&#x5C5E;&#x6027;&#x7684;&#x96C6;&#x5408;&#x3002;</p>
<h3 id="attributes">Attributes</h3>
<p>&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x770B;&#x5230;&#x5C5E;&#x6027;&#x5728;&#x590D;&#x5408;&#x5143;&#x7C7B;&#x578B;&#xFF08;&#x5982; Class &#x548C; Struct&#xFF09;&#x4E2D;&#x5B9A;&#x4E49;&#x3002; &#x4F46;&#x662F;&#x6211;&#x4EEC;&#x7B80;&#x5355;&#x5730;&#x5C06;&#x5C5E;&#x6027;&#x79F0;&#x4E3A;&#x5177;&#x6709;&#x540D;&#x79F0;&#x548C;&#x5143;&#x7C7B;&#x578B;&#x503C;&#x3002; &#x7136;&#x800C;&#xFF0C; Atlas &#x4E2D;&#x7684;&#x5C5E;&#x6027;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x5C5E;&#x6027;&#xFF0C;&#x5B9A;&#x4E49;&#x4E86;&#x4E0E;&#x7C7B;&#x578B;&#x7CFB;&#x7EDF;&#x76F8;&#x5173;&#x7684;&#x66F4;&#x591A;&#x6982;&#x5FF5;&#x3002;</p>
<p>&#x5C5E;&#x6027;&#x5177;&#x6709;&#x4EE5;&#x4E0B;&#x5C5E;&#x6027;&#xFF1A;</p>
<pre><code>name: string,
dataTypeName: string,
isComposite: boolean,
isIndexable: boolean,
isUnique: boolean,
multiplicity: enum,
reverseAttributeName: string
</code></pre><p>&#x4EE5;&#x4E0A;&#x5C5E;&#x6027;&#x5177;&#x6709;&#x4EE5;&#x4E0B;&#x542B;&#x4E49;&#xFF1A;</p>
<ul>
<li><strong>name</strong> - &#x5C5E;&#x6027;&#x7684;&#x540D;&#x79F0;</li>
<li>dataTypeName - &#x5C5E;&#x6027;&#x7684;&#x5143;&#x7C7B;&#x578B;&#x540D;&#x79F0;&#xFF08;&#x672C;&#x673A;&#xFF0C;&#x96C6;&#x5408;&#x6216;&#x590D;&#x5408;&#xFF09;</li>
<li><strong>isComposite</strong> - &#x662F;&#x5426;&#x590D;&#x5408;<ul>
<li>&#x6B64;&#x6807;&#x5FD7;&#x6307;&#x793A;&#x5EFA;&#x6A21;&#x7684;&#x4E00;&#x4E2A;&#x65B9;&#x9762;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x5C5E;&#x6027;&#x88AB;&#x5B9A;&#x4E49;&#x4E3A;&#x590D;&#x5408;&#xFF0C;&#x5B83;&#x610F;&#x5473;&#x7740;&#x5B83;&#x4E0D;&#x80FD;&#x6709;&#x4E00;&#x4E2A;&#x751F;&#x547D;&#x5468;&#x671F;&#x4E0E;&#x5B83;&#x6240;&#x5305;&#x542B;&#x7684;&#x5B9E;&#x4F53;&#x65E0;&#x5173;&#x3002;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x7684;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x4F8B;&#x5B50;&#x662F;&#x6784;&#x6210; hive &#x8868;&#x4E00;&#x90E8;&#x5206;&#x7684;&#x4E00;&#x7EC4;&#x5217;&#x3002;&#x7531;&#x4E8E;&#x5217;&#x5728; hive &#x8868;&#x4E4B;&#x5916;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#xFF0C;&#x5B83;&#x4EEC;&#x88AB;&#x5B9A;&#x4E49;&#x4E3A;&#x7EC4;&#x5408;&#x5C5E;&#x6027;&#x3002;</li>
<li>&#x5FC5;&#x987B;&#x5728; Atlas &#x4E2D;&#x521B;&#x5EFA;&#x590D;&#x5408;&#x5C5E;&#x6027;&#x53CA;&#x5176;&#x6240;&#x5305;&#x542B;&#x7684;&#x5B9E;&#x4F53;&#x3002;&#x5373;&#xFF0C;&#x5FC5;&#x987B;&#x4E0E; hive &#x8868;&#x4E00;&#x8D77;&#x521B;&#x5EFA; hive &#x5217;&#x3002;</li>
</ul>
</li>
<li><strong>isIndexable</strong> - &#x662F;&#x5426;&#x7D22;&#x5F15;<ul>
<li>&#x6B64;&#x6807;&#x5FD7;&#x6307;&#x793A;&#x6B64;&#x5C5E;&#x6027;&#x662F;&#x5426;&#x5E94;&#x8BE5;&#x7D22;&#x5F15;&#xFF0C;&#x4EE5;&#x4FBF;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5C5E;&#x6027;&#x503C;&#x4F5C;&#x4E3A;&#x8C13;&#x8BCD;&#x6765;&#x6267;&#x884C;&#x67E5;&#x627E;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x6709;&#x6548;&#x5730;&#x6267;&#x884C;&#x67E5;&#x627E;&#x3002;</li>
</ul>
</li>
<li><strong>isUnique</strong> - &#x662F;&#x5426;&#x552F;&#x4E00;<ul>
<li>&#x6B64;&#x6807;&#x5FD7;&#x518D;&#x6B21;&#x4E0E;&#x7D22;&#x5F15;&#x76F8;&#x5173;&#x3002;&#x5982;&#x679C;&#x6307;&#x5B9A;&#x4E3A;&#x552F;&#x4E00;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4E3A; Titan &#x4E2D;&#x7684;&#x6B64;&#x5C5E;&#x6027;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x7279;&#x6B8A;&#x7D22;&#x5F15;&#xFF0C;&#x5141;&#x8BB8;&#x57FA;&#x4E8E;&#x7B49;&#x5F0F;&#x7684;&#x67E5;&#x627E;&#x3002;</li>
<li>&#x5177;&#x6709;&#x6B64;&#x6807;&#x5FD7;&#x7684;&#x771F;&#x5B9E;&#x503C;&#x7684;&#x4EFB;&#x4F55;&#x5C5E;&#x6027;&#x90FD;&#x88AB;&#x89C6;&#x4E3A;&#x4E3B;&#x952E;&#xFF0C;&#x4EE5;&#x5C06;&#x6B64;&#x5B9E;&#x4F53;&#x4E0E;&#x5176;&#x4ED6;&#x5B9E;&#x4F53;&#x533A;&#x5206;&#x5F00;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5E94;&#x6CE8;&#x610F;&#x786E;&#x4FDD;&#x6B64;&#x5C5E;&#x6027;&#x5728;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x4E2D;&#x6A21;&#x62DF;&#x72EC;&#x7279;&#x7684;&#x5C5E;&#x6027;&#x3002;<ul>
<li>&#x4F8B;&#x5982;&#xFF0C;&#x8003;&#x8651; hive_table &#x7684; name &#x5C5E;&#x6027;&#x3002;&#x5B64;&#x7ACB;&#x5730;&#xFF0C;&#x540D;&#x79F0;&#x4E0D;&#x662F; hive_table &#x7684;&#x552F;&#x4E00;&#x5C5E;&#x6027;&#xFF0C;&#x56E0;&#x4E3A;&#x5177;&#x6709;&#x76F8;&#x540C;&#x540D;&#x79F0;&#x7684;&#x8868;&#x53EF;&#x4EE5;&#x5B58;&#x5728;&#x4E8E;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x3002;&#x5982;&#x679C; Atlas &#x5728;&#x591A;&#x4E2A;&#x96C6;&#x7FA4;&#x4E2D;&#x5B58;&#x50A8; hive &#x8868;&#x7684;&#x5143;&#x6570;&#x636E;&#xFF0C;&#x5373;&#x4F7F;&#x4E00;&#x5BF9;&#xFF08;&#x6570;&#x636E;&#x5E93;&#x540D;&#x79F0;&#xFF0C;&#x8868;&#x540D;&#x79F0;&#xFF09;&#x4E5F;&#x4E0D;&#x662F;&#x552F;&#x4E00;&#x7684;&#x3002;&#x53EA;&#x6709;&#x96C6;&#x7FA4;&#x4F4D;&#x7F6E;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x540D;&#x79F0;&#x548C;&#x8868;&#x540D;&#x79F0;&#x53EF;&#x4EE5;&#x5728;&#x7269;&#x7406;&#x4E16;&#x754C;&#x4E2D;&#x88AB;&#x89C6;&#x4E3A;&#x552F;&#x4E00;&#x3002;</li>
</ul>
</li>
</ul>
</li>
<li><strong>multiplicity</strong> - &#x6307;&#x793A;&#x6B64;&#x5C5E;&#x6027;&#x662F;&#xFF08;&#x5FC5;&#x9700;&#x7684;&#xFF0F;&#x53EF;&#x9009;&#x7684;&#xFF0F;&#x8FD8;&#x662F;&#x53EF;&#x4EE5;&#x662F;&#x591A;&#x503C;&#xFF09;&#x7684;&#x3002;&#x5982;&#x679C;&#x5B9E;&#x4F53;&#x7684;&#x5C5E;&#x6027;&#x503C;&#x7684;&#x5B9A;&#x4E49;&#x4E0E;&#x7C7B;&#x578B;&#x5B9A;&#x4E49;&#x4E2D;&#x7684;&#x591A;&#x91CD;&#x6027;&#x58F0;&#x660E;&#x4E0D;&#x5339;&#x914D;&#xFF0C;&#x5219;&#x8FD9;&#x5C06;&#x662F;&#x4E00;&#x4E2A;&#x7EA6;&#x675F;&#x8FDD;&#x53CD;&#xFF0C;&#x5E76;&#x4E14;&#x5B9E;&#x4F53;&#x6DFB;&#x52A0;&#x5C06;&#x5931;&#x8D25;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8BE5;&#x5B57;&#x6BB5;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x5B9A;&#x4E49;&#x5143;&#x6570;&#x636E;&#x4FE1;&#x606F;&#x4E0A;&#x7684;&#x4E00;&#x4E9B;&#x7EA6;&#x675F;&#x3002;</li>
</ul>
<p>&#x4F7F;&#x7528;&#x4E0A;&#x9762;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x6269;&#x5C55;&#x4E0B;&#x9762;&#x7684; hive &#x8868;&#x7684;&#x5C5E;&#x6027;&#x4E4B;&#x4E00;&#x7684;&#x5C5E;&#x6027;&#x5B9A;&#x4E49;&#x3002;&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x79F0;&#x4E3A; &quot;db&quot; &#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x5B83;&#x8868;&#x793A; hive &#x8868;&#x6240;&#x5C5E;&#x7684;&#x6570;&#x636E;&#x5E93;&#xFF1A;</p>
<pre><code>db:
    &quot;dataTypeName&quot;: &quot;hive_db&quot;,
    &quot;isComposite&quot;: false,
    &quot;isIndexable&quot;: true,
    &quot;isUnique&quot;: false,
    &quot;multiplicity&quot;: &quot;required&quot;,
    &quot;name&quot;: &quot;db&quot;,
    &quot;reverseAttributeName&quot;: null
</code></pre><p>&#x6CE8;&#x610F;&#x591A;&#x91CD;&#x6027;&#x7684; &quot;multiplicity&quot; = &quot;required&quot; &#x7EA6;&#x675F;&#x3002; &#x5982;&#x679C;&#x6CA1;&#x6709; db &#x5F15;&#x7528;&#xFF0C;&#x5219;&#x4E0D;&#x80FD;&#x53D1;&#x9001;&#x8868;&#x5B9E;&#x4F53;&#x3002;</p>
<pre><code>columns:
    &quot;dataTypeName&quot;: &quot;array&lt;hive_column&gt;&quot;,
    &quot;isComposite&quot;: true,
    &quot;isIndexable&quot;: true,
    &#x201C;isUnique&quot;: false,
    &quot;multiplicity&quot;: &quot;optional&quot;,
    &quot;name&quot;: &quot;columns&quot;,
    &quot;reverseAttributeName&quot;: null
</code></pre><p>&#x8BF7;&#x6CE8;&#x610F;&#x5217;&#x7684; &quot;isComposite&quot; = true &#x503C;&#x3002;&#x901A;&#x8FC7;&#x8FD9;&#x6837;&#x505A;&#xFF0C;&#x6211;&#x4EEC;&#x6307;&#x793A;&#x5B9A;&#x4E49;&#x7684;&#x5217;&#x5B9E;&#x4F53;&#x5E94;&#x8BE5;&#x59CB;&#x7EC8;&#x7ED1;&#x5B9A;&#x5230;&#x5B83;&#x4EEC;&#x5B9A;&#x4E49;&#x7684;&#x8868;&#x5B9E;&#x4F53;&#x3002;</p>
<p>&#x4ECE;&#x8FD9;&#x4E2A;&#x63CF;&#x8FF0;&#x548C;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x60A8;&#x5C06;&#x80FD;&#x591F;&#x610F;&#x8BC6;&#x5230;&#x5C5E;&#x6027;&#x5B9A;&#x4E49;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x5F71;&#x54CD; Atlas &#x7CFB;&#x7EDF;&#x8981;&#x6267;&#x884C;&#x7684;&#x7279;&#x5B9A;&#x5EFA;&#x6A21;&#x884C;&#x4E3A;&#xFF08;&#x7EA6;&#x675F;&#xFF0C;&#x7D22;&#x5F15;&#x7B49;&#xFF09;&#x3002;</p>
<h3 id="&#x7CFB;&#x7EDF;&#x7279;&#x5B9A;&#x7C7B;&#x578B;&#x53CA;&#x5176;&#x610F;&#x4E49;">&#x7CFB;&#x7EDF;&#x7279;&#x5B9A;&#x7C7B;&#x578B;&#x53CA;&#x5176;&#x610F;&#x4E49;</h3>
<p>Atlas &#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E9B;&#x9884;&#x5B9A;&#x4E49;&#x7684;&#x7CFB;&#x7EDF;&#x7C7B;&#x578B;&#x3002;&#x6211;&#x4EEC;&#x5728;&#x524D;&#x9762;&#x7684;&#x7AE0;&#x8282;&#x4E2D;&#x770B;&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF08;DataSet&#xFF09;&#x3002;&#x5728;&#x672C;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x770B;&#x5230;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x7C7B;&#x578B;&#x5E76;&#x4E86;&#x89E3;&#x5B83;&#x4EEC;&#x7684;&#x610F;&#x4E49;&#x3002;</p>
<p><strong>Referenceable</strong>&#xFF1A;&#x6B64;&#x7C7B;&#x578B;&#x8868;&#x793A;&#x53EF;&#x4F7F;&#x7528;&#x540D;&#x4E3A; qualifiedName &#x7684;&#x552F;&#x4E00;&#x5C5E;&#x6027;&#x641C;&#x7D22;&#x7684;&#x6240;&#x6709;&#x5B9E;&#x4F53;&#x3002;</p>
<p><strong>Asset</strong>&#xFF1A;&#x6B64;&#x7C7B;&#x578B;&#x5305;&#x542B;&#x540D;&#x79F0;&#xFF0C;&#x8BF4;&#x660E;&#x548C;&#x6240;&#x6709;&#x8005;&#x7B49;&#x5C5E;&#x6027;&#x3002;&#x540D;&#x79F0;&#x662F;&#x5FC5;&#x9700;&#x5C5E;&#x6027;&#xFF08;multiplicity = required&#xFF09;&#xFF0C;&#x5176;&#x4ED6;&#x662F;&#x53EF;&#x9009;&#x7684;&#x3002;&#x53EF;&#x5F15;&#x7528;&#x548C;&#x8D44;&#x6E90;&#x7684;&#x76EE;&#x7684;&#x662F;&#x4E3A;&#x5B9A;&#x578B;&#x5668;&#x63D0;&#x4F9B;&#x5728;&#x5B9A;&#x4E49;&#x548C;&#x67E5;&#x8BE2;&#x5176;&#x81EA;&#x8EAB;&#x7C7B;&#x578B;&#x7684;&#x5B9E;&#x4F53;&#x65F6;&#x5F3A;&#x5236;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x62E5;&#x6709;&#x8FD9;&#x4E9B;&#x56FA;&#x5B9A;&#x7684;&#x5C5E;&#x6027;&#x96C6;&#x5141;&#x8BB8;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x548C;&#x7528;&#x6237;&#x754C;&#x9762;&#x57FA;&#x4E8E;&#x7EA6;&#x5B9A;&#x57FA;&#x4E8E;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x671F;&#x671B;&#x7684;&#x5C5E;&#x6027;&#x7684;&#x5047;&#x8BBE;&#x3002;</p>
<p><strong>Infrastructure</strong>&#xFF1A;&#x6B64;&#x7C7B;&#x578B;&#x6269;&#x5C55;&#x4E86;&#x53EF;&#x5F15;&#x7528;&#x548C;&#x8D44;&#x4EA7;&#xFF0C;&#x901A;&#x5E38;&#x53EF;&#x7528;&#x4E8E;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x5143;&#x6570;&#x636E;&#x5BF9;&#x8C61;&#xFF08;&#x5982;&#x7FA4;&#x96C6;&#xFF0C;&#x4E3B;&#x673A;&#x7B49;&#xFF09;&#x7684;&#x5E38;&#x7528;&#x8D85;&#x7C7B;&#x578B;&#x3002;</p>
<p><strong>DataSet</strong>&#xFF1A;&#x6B64;&#x7C7B;&#x578B;&#x6269;&#x5C55;&#x4E86;&#x53EF;&#x5F15;&#x7528;&#x548C;&#x8D44;&#x4EA7;&#x3002;&#x5728;&#x6982;&#x5FF5;&#x4E0A;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x8868;&#x793A;&#x5B58;&#x50A8;&#x6570;&#x636E;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x5728; Atlas &#x4E2D;&#xFF0C;hive&#x8868;&#xFF0C;Sqoop RDBMS&#x8868;&#x7B49;&#x90FD;&#x662F;&#x4ECE; DataSet &#x6269;&#x5C55;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x6269;&#x5C55; DataSet &#x7684;&#x7C7B;&#x578B;&#x53EF;&#x4EE5;&#x671F;&#x671B;&#x5177;&#x6709;&#x6A21;&#x5F0F;&#xFF0C;&#x5B83;&#x4EEC;&#x5C06;&#x5177;&#x6709;&#x5B9A;&#x4E49;&#x8BE5;&#x6570;&#x636E;&#x96C6;&#x7684;&#x5C5E;&#x6027;&#x7684;&#x5C5E;&#x6027;&#x3002;&#x4F8B;&#x5982;&#xFF0C; hive_table &#x4E2D;&#x7684; columns &#x5C5E;&#x6027;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x6269;&#x5C55; DataSet &#x7684;&#x5B9E;&#x4F53;&#x7C7B;&#x578B;&#x7684;&#x5B9E;&#x4F53;&#x53C2;&#x4E0E;&#x6570;&#x636E;&#x8F6C;&#x6362;&#xFF0C;&#x8FD9;&#x79CD;&#x8F6C;&#x6362;&#x53EF;&#x4EE5;&#x7531; Atlas &#x901A;&#x8FC7; lineage&#xFF08;&#x6216; provenance&#xFF09;&#x751F;&#x6210;&#x56FE;&#x5F62;&#x3002;</p>
<p><strong>Process</strong>&#xFF1A;&#x6B64;&#x7C7B;&#x578B;&#x6269;&#x5C55;&#x4E86;&#x53EF;&#x5F15;&#x7528;&#x548C;&#x8D44;&#x4EA7;&#x3002;&#x5728;&#x6982;&#x5FF5;&#x4E0A;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x8868;&#x793A;&#x4EFB;&#x4F55;&#x6570;&#x636E;&#x53D8;&#x6362;&#x64CD;&#x4F5C;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5C06;&#x539F;&#x59CB;&#x6570;&#x636E;&#x7684; hive &#x8868;&#x8F6C;&#x6362;&#x4E3A;&#x5B58;&#x50A8;&#x67D0;&#x4E2A;&#x805A;&#x5408;&#x7684;&#x53E6;&#x4E00;&#x4E2A; hive &#x8868;&#x7684; ETL &#x8FC7;&#x7A0B;&#x53EF;&#x4EE5;&#x662F;&#x6269;&#x5C55;&#x8FC7;&#x7A0B;&#x7C7B;&#x578B;&#x7684;&#x7279;&#x5B9A;&#x7C7B;&#x578B;&#x3002;&#x6D41;&#x7A0B;&#x7C7B;&#x578B;&#x6709;&#x4E24;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x3002;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x90FD;&#x662F; DataSet &#x5B9E;&#x4F53;&#x7684;&#x6570;&#x7EC4;&#x3002;&#x56E0;&#x6B64;&#xFF0C;Process &#x7C7B;&#x578B;&#x7684;&#x5B9E;&#x4F8B;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x6765;&#x6355;&#x83B7; DataSet &#x7684; lineage &#x5982;&#x4F55;&#x6F14;&#x53D8;&#x3002;</p>
<h2 id="search">Search</h2>
<p>Atlas &#x652F;&#x6301;&#x4EE5;&#x4E0B; 2 &#x79CD;&#x65B9;&#x5F0F;&#x641C;&#x7D22;&#x5143;&#x6570;&#x636E;:</p>
<ul>
<li>Search using DSL</li>
<li>Full-text search</li>
</ul>
<h2 id="hive-atlas-bridge"><a href="http://atlas.apache.org/Bridge-Hive.html" target="_blank">Hive Atlas Bridge</a></h2>
<h3 id="hive-model">Hive Model</h3>
<p>&#x9ED8;&#x8BA4; hive &#x5EFA;&#x6A21;&#x5728; org.apache.atlas.hive.model.HiveDataModelGenerator &#x4E2D;&#x53EF;&#x7528;&#x3002; &#x5B83;&#x5B9A;&#x4E49;&#x4EE5;&#x4E0B;&#x7C7B;&#x578B;&#xFF1A;</p>
<pre><code>hive_db(ClassType) - super types [Referenceable] - attributes [name, clusterName, description, locationUri, parameters, ownerName, ownerType]
hive_storagedesc(ClassType) - super types [Referenceable] - attributes [cols, location, inputFormat, outputFormat, compressed, numBuckets, serdeInfo, bucketCols, sortCols, parameters, storedAsSubDirectories]
hive_column(ClassType) - super types [Referenceable] - attributes [name, type, comment, table]
hive_table(ClassType) - super types [DataSet] - attributes [name, db, owner, createTime, lastAccessTime, comment, retention, sd, partitionKeys, columns, aliases, parameters, viewOriginalText, viewExpandedText, tableType, temporary]
hive_process(ClassType) - super types [Process] - attributes [name, startTime, endTime, userName, operationType, queryText, queryPlan, queryId]
hive_principal_type(EnumType) - values [USER, ROLE, GROUP]
hive_order(StructType) - attributes [col, order]
hive_serde(StructType) - attributes [name, serializationLib, parameters]
</code></pre><p>&#x4F7F;&#x7528;&#x552F;&#x4E00;&#x7684;&#x9650;&#x5B9A;&#x540D;&#x79F0;&#x521B;&#x5EFA;&#x548C;&#x53BB;&#x91CD;&#x590D;&#x5B9E;&#x4F53;&#x3002;&#x5B83;&#x4EEC;&#x63D0;&#x4F9B;&#x547D;&#x540D;&#x7A7A;&#x95F4;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x4E8E; query&#xFF0F;lineage&#x3002;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;dbName&#xFF0C;tableName &#x548C; columnName &#x5E94;&#x4E3A;&#x5C0F;&#x5199;&#x3002; clusterName &#x89E3;&#x91CA;&#x5982;&#x4E0B;&#x3002;</p>
<ul>
<li>hive_db - attribute qualifiedName - &lt;dbName&gt;@<clustername></clustername></li>
<li>hive_table - attribute qualifiedName - <dbname>.&lt;tableName&gt;@<clustername></clustername></dbname></li>
<li>hive_column - attribute qualifiedName - <dbname>.<tablename>.&lt;columnName&gt;@<clustername></clustername></tablename></dbname></li>
<li>hive_process - attribute name - <querystring> - &#x5C0F;&#x5199;&#x7684;&#x4FEE;&#x526A;&#x67E5;&#x8BE2;&#x5B57;&#x7B26;&#x4E32;</querystring></li>
</ul>
<h3 id="&#x5BFC;&#x5165;-hive-metadata">&#x5BFC;&#x5165; Hive Metadata</h3>
<p><code>org.apache.atlas.hive.bridge.HiveMetaStoreBridge</code> &#x4F7F;&#x7528; <code>org.apache.atlas.hive.model.HiveDataModelGenerator</code> &#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x6A21;&#x578B;&#x5C06; Hive &#x5143;&#x6570;&#x636E;&#x5BFC;&#x5165; Atlas&#x3002; <code>import-hive.sh</code> &#x547D;&#x4EE4;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x65B9;&#x4FBF;&#x8FD9;&#x4E00;&#x70B9;&#x3002;&#x811A;&#x672C;&#x9700;&#x8981; Hadoop &#x548C; Hive &#x7C7B;&#x8DEF;&#x5F84; jar&#x3002; &#x5BF9;&#x4E8E; Hadoop jar&#xFF0C;&#x8BF7;&#x786E;&#x4FDD;&#x73AF;&#x5883;&#x53D8;&#x91CF; HADOOP_CLASSPATH &#x5DF2;&#x8BBE;&#x7F6E;&#x3002;&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x5C06; HADOOP_HOME &#x8BBE;&#x7F6E;&#x4E3A;&#x6307;&#x5411; Hadoop &#x5B89;&#x88C5;&#x7684;&#x6839;&#x76EE;&#x5F55;&#x540C;&#x6837;&#xFF0C;&#x5BF9;&#x4E8E; Hive jar&#xFF0C;&#x5C06; HIVE_HOME &#x8BBE;&#x7F6E;&#x4E3A; Hive &#x5B89;&#x88C5;&#x7684;&#x6839;&#x76EE;&#x5F55;&#x5C06;&#x73AF;&#x5883;&#x53D8;&#x91CF; HIVE_CONF_DIR &#x8BBE;&#x7F6E;&#x4E3A; Hive &#x914D;&#x7F6E;&#x76EE;&#x5F55;&#x590D;&#x5236; <code>${atlas-conf}/atlas-application.properties</code> &#x5230; hive conf &#x76EE;&#x5F55;</p>
<pre><code>Usage: &lt;atlas package&gt;/hook-bin/import-hive.sh
</code></pre><p>&#x65E5;&#x5FD7;&#x4F4D;&#x4E8E; ${atlas package}/logs/import-hive.log</p>
<p>&#x5982;&#x679C;&#x8981;&#x5728; kerberized &#x96C6;&#x7FA4;&#x4E2D;&#x5BFC;&#x5165;&#x5143;&#x6570;&#x636E;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x8FD0;&#x884C;&#x4EE5;&#x4E0B;&#x547D;&#x4EE4;&#xFF1A;</p>
<pre><code>&lt;atlas package&gt;/hook-bin/import-hive.sh -Dsun.security.jgss.debug=true -Djavax.security.auth.useSubjectCredsOnly=false -Djava.security.krb5.conf=[krb5.conf location] -Djava.security.auth.login.config=[jaas.conf location]
</code></pre><ul>
<li>krb5.conf is typically found at /etc/krb5.conf</li>
<li>for details about jaas.conf and a suggested location see the <a href="http://atlas.apache.org/Security.html" target="_blank">atlas security documentation</a></li>
</ul>
<h3 id="hive-hook">Hive Hook</h3>
<p>Hive &#x5728;&#x4F7F;&#x7528; hive hook &#x7684; hive &#x547D;&#x4EE4;&#x6267;&#x884C;&#x4E0A;&#x652F;&#x6301;&#x4FA6;&#x542C;&#x5668;&#x3002; &#x8FD9;&#x7528;&#x4E8E;&#x5728; Atlas &#x4E2D;&#x4F7F;&#x7528; <code>org.apache.atlas.hive.model.HiveDataModelGenerator</code> &#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x6A21;&#x578B;&#x6DFB;&#x52A0;/&#x66F4;&#x65B0;/&#x5220;&#x9664;&#x5B9E;&#x4F53;&#x3002; hive hook &#x5C06;&#x8BF7;&#x6C42;&#x63D0;&#x4EA4;&#x7ED9;&#x7EBF;&#x7A0B;&#x6C60;&#x6267;&#x884C;&#x5668;&#xFF0C;&#x4EE5;&#x907F;&#x514D;&#x963B;&#x585E;&#x547D;&#x4EE4;&#x6267;&#x884C;&#x3002; &#x7EBF;&#x7A0B;&#x5C06;&#x5B9E;&#x4F53;&#x4F5C;&#x4E3A;&#x6D88;&#x606F;&#x63D0;&#x4EA4;&#x7ED9;&#x901A;&#x77E5;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5E76;&#x4E14;&#x670D;&#x52A1;&#x5668;&#x8BFB;&#x53D6;&#x8FD9;&#x4E9B;&#x6D88;&#x606F;&#x5E76;&#x6CE8;&#x518C;&#x5B9E;&#x4F53;&#x3002; &#x6309;&#x7167; hive &#x8BBE;&#x7F6E;&#x4E2D;&#x7684;&#x8FD9;&#x4E9B;&#x8BF4;&#x660E;&#x4E3A; Atlas &#x6DFB;&#x52A0;  hive hook &#xFF1A;</p>
<ul>
<li>Set-up atlas hook in hive-site.xml of your hive configuration:</li>
</ul>
<pre><code>&lt;property&gt;
&lt;name&gt;hive.exec.post.hooks&lt;/name&gt;
&lt;value&gt;org.apache.atlas.hive.hook.HiveHook&lt;/value&gt;
&lt;/property&gt;
</code></pre><pre><code>&lt;property&gt;
&lt;name&gt;atlas.cluster.name&lt;/name&gt;
&lt;value&gt;primary&lt;/value&gt;
&lt;/property&gt;
</code></pre><ul>
<li>Add &apos;export HIVE_AUX_JARS_PATH=<atlas package="">/hook/hive&apos; in hive-env.sh of your hive configuration</atlas></li>
<li>Copy <atlas-conf>/atlas-application.properties to the hive conf directory.</atlas-conf></li>
</ul>
<p>&#x5728;<atlas-conf> /atlas-application.properties&#x4E2D;&#x7684;&#x4EE5;&#x4E0B;&#x5C5E;&#x6027;&#x63A7;&#x5236;&#x7EBF;&#x7A0B;&#x6C60;&#x548C;&#x901A;&#x77E5;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#xFF1A;</atlas-conf></p>
<ul>
<li>atlas.hook.hive.synchronous - boolean&#xFF0C;true&#x6765;&#x540C;&#x6B65;&#x8FD0;&#x884C;&#x94A9;&#x5B50;&#x3002; &#x9ED8;&#x8BA4;false&#x3002; &#x5EFA;&#x8BAE;&#x8BBE;&#x7F6E;&#x4E3A;false&#xFF0C;&#x4EE5;&#x907F;&#x514D; hive &#x67E5;&#x8BE2;&#x5B8C;&#x6210;&#x4E2D;&#x7684;&#x5EF6;&#x8FDF;&#x3002;</li>
<li>atlas.hook.hive.numRetries - &#x901A;&#x77E5;&#x5931;&#x8D25;&#x7684;&#x91CD;&#x8BD5;&#x6B21;&#x6570;&#x3002; &#x9ED8;&#x8BA4;&#x503C; 3</li>
<li>atlas.hook.hive.minThreads - &#x6838;&#x5FC3;&#x7EBF;&#x7A0B;&#x6570;&#x3002; &#x9ED8;&#x8BA4;&#x503C; 5</li>
<li>atlas.hook.hive.maxThreads - &#x6700;&#x5927;&#x7EBF;&#x7A0B;&#x6570;&#x3002; &#x9ED8;&#x8BA4;&#x503C; 5</li>
<li>atlas.hook.hive.keepAliveTime - &#x4FDD;&#x6301;&#x6D3B;&#x52A8;&#x65F6;&#x95F4;&#x4EE5;&#x6BEB;&#x79D2;&#x4E3A;&#x5355;&#x4F4D;&#x3002; &#x9ED8;&#x8BA4; 10</li>
<li>atlas.hook.hive.queueSize - &#x7EBF;&#x7A0B;&#x6C60;&#x7684;&#x961F;&#x5217;&#x5927;&#x5C0F;&#x3002; &#x9ED8;&#x8BA4; 10000</li>
</ul>
<p>&#x53C2;&#x8003;  <a href="http://atlas.apache.org/Configuration.html" target="_blank">Configuration</a> &#x901A;&#x77E5;&#x76F8;&#x5173;&#x914D;&#x7F6E;</p>
<h3 id="column-level-lineage">Column Level Lineage</h3>
<p>&#x4ECE; atlas-0.8-incubating &#x7248;&#x672C;&#x5F00;&#x59CB;&#xFF0C;&#x5728; Atlas &#x4E2D;&#x6355;&#x83B7;&#x5217; lineage</p>
<h4 id="model">Model</h4>
<ul>
<li>ColumnLineageProcess &#x7C7B;&#x578B;&#x662F; Process &#x7684;&#x5B50;&#x7C7B;</li>
<li>&#x8FD9;&#x5C06;&#x8F93;&#x51FA;&#x5217;&#x4E0E;&#x4E00;&#x7EC4;&#x8F93;&#x5165;&#x5217;&#x6216;&#x8F93;&#x5165;&#x8868;&#x76F8;&#x5173;&#x8054;</li>
<li>Lineage &#x8FD8;&#x6355;&#x83B7; Dependency &#x7684;&#x7C7B;&#x578B;&#xFF1A;&#x5F53;&#x524D;&#x7684;&#x503C;&#x662F; SIMPLE&#xFF0C;EXPRESSION&#xFF0C;SCRIPT<ul>
<li><strong>SIMPLE&#x4F9D;&#x8D56;&#xFF1A;</strong> &#x610F;&#x5473;&#x7740;&#x8F93;&#x51FA;&#x5217;&#x5177;&#x6709;&#x4E0E;&#x8F93;&#x5165;&#x76F8;&#x540C;&#x7684;&#x503C;</li>
<li><strong>EXPRESSION&#x4F9D;&#x8D56;&#xFF1A;</strong> &#x610F;&#x5473;&#x7740;&#x8F93;&#x51FA;&#x5217;&#x88AB;&#x8F93;&#x5165;&#x5217;&#x4E0A;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x8868;&#x8FBE;&#x5F0F;&#xFF08;&#x4F8B;&#x5982;Hive SQL&#x8868;&#x8FBE;&#x5F0F;&#xFF09;&#x8F6C;&#x6362;&#x3002;</li>
<li><strong>SCRIPT&#x4F9D;&#x8D56;&#xFF1A;</strong> &#x8868;&#x793A;&#x8F93;&#x51FA;&#x5217;&#x7531;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x7684;&#x811A;&#x672C;&#x8F6C;&#x6362;&#x3002;</li>
</ul>
</li>
<li>&#x5728; <strong>EXPRESSION</strong> &#x4F9D;&#x8D56;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8868;&#x8FBE;&#x5F0F;&#x5C5E;&#x6027;&#x5305;&#x542B;&#x5B57;&#x7B26;&#x4E32;&#x5F62;&#x5F0F;&#x7684;&#x8868;&#x8FBE;&#x5F0F;</li>
<li>&#x7531;&#x4E8E; Process &#x94FE;&#x63A5;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA; DataSet&#xFF0C;&#x6211;&#x4EEC;&#x4F7F; Column &#x6210;&#x4E3A; DataSet &#x7684;&#x5B50;&#x7C7B;</li>
</ul>
<h4 id="examples">Examples</h4>
<p>&#x5BF9;&#x4E8E;&#x4E0B;&#x9762;&#x7684;&#x7B80;&#x5355; CTAS&#xFF1A;</p>
<pre><code class="lang-sql"><span class="hljs-keyword">create</span> <span class="hljs-keyword">table</span> t2 <span class="hljs-keyword">as</span> <span class="hljs-keyword">select</span> <span class="hljs-keyword">id</span>, <span class="hljs-keyword">name</span> <span class="hljs-keyword">from</span> T1
</code></pre>
<p>lineage &#x4E3A;</p>
<p><img src="assets/column_lineage_ex1.png" alt=""></p>
<h4 id="extracting-lineage-from-hive-commands">Extracting Lineage from Hive commands</h4>
<ul>
<li><p>HiveHook &#x5C06; HookContext &#x4E2D;&#x7684; LineageInfo &#x6620;&#x5C04;&#x5230; Column lineage &#x5B9E;&#x4F8B;</p>
</li>
<li><p>Hive &#x4E2D;&#x7684; LineageInfo &#x4E3A;&#x6700;&#x7EC8;&#x7684; FileSinkOperator &#x63D0;&#x4F9B; Column lineage &#xFF0C;&#x5C06;&#x5B83;&#x4EEC;&#x94FE;&#x63A5;&#x5230; Hive &#x67E5;&#x8BE2;&#x4E2D;&#x7684;&#x8F93;&#x5165;&#x5217;</p>
</li>
</ul>
<h4 id="note">NOTE</h4>
<p>&#x5728;&#x5C06; <a href="https://issues.apache.org/jira/browse/HIVE-13112" target="_blank">HIVE-13112</a> &#x7684;&#x8865;&#x4E01;&#x5E94;&#x7528;&#x4E8E; Hive &#x6E90;&#x4E4B;&#x540E;&#xFF0C;&#x5217;&#x7EA7;&#x522B; lineage &#x4E0E; Hive &#x7248;&#x672C;1.2.1&#x914D;&#x5408;&#x4F7F;&#x7528;</p>
<h3 id="limitations">Limitations</h3>
<ul>
<li>&#x7531;&#x4E8E;&#x6570;&#x636E;&#x5E93;&#x540D;&#xFF0C;&#x8868;&#x540D;&#x548C;&#x5217;&#x540D;&#x5728; hive &#x4E2D;&#x4E0D;&#x533A;&#x5206;&#x5927;&#x5C0F;&#x5199;&#xFF0C;&#x56E0;&#x6B64;&#x5B9E;&#x4F53;&#x4E2D;&#x7684;&#x5BF9;&#x5E94;&#x540D;&#x79F0;&#x4E3A;&#x5C0F;&#x5199;&#x3002; &#x56E0;&#x6B64;&#xFF0C;&#x4EFB;&#x4F55;&#x641C;&#x7D22; API &#x90FD;&#x5E94;&#x8BE5;&#x5728;&#x67E5;&#x8BE2;&#x5B9E;&#x4F53;&#x540D;&#x79F0;&#x65F6;&#x4F7F;&#x7528;&#x5C0F;&#x5199;</li>
<li>&#x4EE5;&#x4E0B; hive &#x64CD;&#x4F5C;&#x7531; hive hook &#x5F53;&#x524D;&#x6355;&#x83B7;<ul>
<li>create database</li>
<li>create table/view, create table as select</li>
<li>load, import, export</li>
<li>DMLs (insert)</li>
<li>alter database</li>
<li>alter table (skewed table information, stored as, protection is not supported)</li>
<li>alter view</li>
</ul>
</li>
</ul>
<h2 id="sqoop-atlas-bridge">Sqoop Atlas Bridge</h2>
<h3 id="sqoop-model">Sqoop Model</h3>
<p>&#x9ED8;&#x8BA4;&#x7684; Sqoop &#x5EFA;&#x6A21;&#x5728; <code>org.apache.atlas.sqoop.model.SqoopDataModelGenerator</code> &#x4E2D;&#x53EF;&#x7528;&#x3002; &#x5B83;&#x5B9A;&#x4E49;&#x4EE5;&#x4E0B;&#x7C7B;&#x578B;&#xFF1A;</p>
<pre><code>sqoop_operation_type(EnumType) - values [IMPORT, EXPORT, EVAL]
sqoop_dbstore_usage(EnumType) - values [TABLE, QUERY, PROCEDURE, OTHER]
sqoop_process(ClassType) - super types [Process] - attributes [name, operation, dbStore, hiveTable, commandlineOpts, startTime, endTime, userName]
sqoop_dbdatastore(ClassType) - super types [DataSet] - attributes [name, dbStoreType, storeUse, storeUri, source, description, ownerName]
</code></pre><p>&#x4F7F;&#x7528;&#x552F;&#x4E00;&#x7684;&#x9650;&#x5B9A;&#x540D;&#x79F0;&#x521B;&#x5EFA;&#x548C;&#x53BB;&#x91CD;&#x590D;&#x5B9E;&#x4F53;&#x3002; &#x5B83;&#x4EEC;&#x63D0;&#x4F9B;&#x547D;&#x540D;&#x7A7A;&#x95F4;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x67E5;&#x8BE2;&#xFF1A;sqoop_process - attribute name - sqoop-dbStoreType-storeUri-endTime sqoop_dbdatastore - attribute name - dbStoreType-connectorUrl-source</p>
<h3 id="sqoop-hook">Sqoop Hook</h3>
<p>Sqoop &#x6DFB;&#x52A0;&#x4E86;&#x4E00;&#x4E2A; SqoopJobDataPublisher&#xFF0C;&#x5728;&#x5B8C;&#x6210;&#x5BFC;&#x5165;&#x4F5C;&#x4E1A;&#x540E;&#x5C06;&#x6570;&#x636E;&#x53D1;&#x5E03;&#x5230; Atlas&#x3002; &#x73B0;&#x5728; sqoopHook &#x53EA;&#x652F;&#x6301;hiveImport&#x3002; &#x8FD9;&#x7528;&#x4E8E;&#x4F7F;&#x7528; <code>org.apache.atlas.sqoop.model.SqoopDataModelGenerator</code> &#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x6A21;&#x578B;&#x5728; Atlas &#x4E2D;&#x6DFB;&#x52A0;&#x5B9E;&#x4F53;&#x3002; &#x6309;&#x7167; sqoop &#x8BBE;&#x7F6E;&#x4E2D;&#x7684;&#x4EE5;&#x4E0B;&#x8BF4;&#x660E;&#x5728; <code>${sqoop-conf}/sqoop-site.xml</code> &#x4E2D;&#x4E3A; Atlas &#x6DFB;&#x52A0; sqoop &#x94A9;&#x5B50;&#xFF1A;</p>
<ul>
<li>Sqoop Job publisher class. Currently only one publishing class is supported</li>
</ul>
<p>sqoop.job.data.publish.class org.apache.atlas.sqoop.hook.SqoopHook</p>
<ul>
<li>Atlas cluster name</li>
</ul>
<p>atlas.cluster.name</p>
<ul>
<li>&#x590D;&#x5236; <code>${atlas-conf}/atlas-application.properties</code> &#x5230; sqoop &#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x5939; <code>${sqoop-conf}/</code></li>
<li>Link <code>${atlas-home}/hook/sqoop/*.jar</code> in sqoop libRefer <a href="http://atlas.apache.org/Configuration.html" target="_blank">Configuration</a> for notification related configurations</li>
</ul>
<h3 id="limitations">Limitations</h3>
<ul>
<li>&#x76EE;&#x524D; sqoop hook &#x53EA;&#x652F;&#x6301; hiveImport &#x8FD9;&#x4E00;&#x79CD; sqoop &#x64CD;&#x4F5C;</li>
</ul>
<h2 id="falcon-atlas-bridge">Falcon Atlas Bridge</h2>
<h3 id="falcon-model">Falcon Model</h3>
<p>&#x9ED8;&#x8BA4;&#x7684;falcon&#x5EFA;&#x6A21;&#x5728; <code>org.apache.atlas.falcon.model.FalconDataModelGenerator</code>. &#x5B83;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x4EE5;&#x4E0B;&#x7C7B;&#x578B;&#xFF1A;</p>
<pre><code>falcon_cluster(ClassType) - super types [Infrastructure] - attributes [timestamp, colo, owner, tags]
falcon_feed(ClassType) - super types [DataSet] - attributes [timestamp, stored-in, owner, groups, tags]
falcon_feed_creation(ClassType) - super types [Process] - attributes [timestamp, stored-in, owner]
falcon_feed_replication(ClassType) - super types [Process] - attributes [timestamp, owner]
falcon_process(ClassType) - super types [Process] - attributes [timestamp, runs-on, owner, tags, pipelines, workflow-properties]
</code></pre><p>&#x4E3A; falcon &#x8FDB;&#x7A0B;&#x5B9A;&#x4E49;&#x7684;&#x6BCF;&#x4E2A;&#x96C6;&#x7FA4;&#x521B;&#x5EFA;&#x4E00;&#x4E2A; falcon_process &#x5B9E;&#x4F53;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x552F;&#x4E00;&#x7684; qualifiedName &#x5C5E;&#x6027;&#x521B;&#x5EFA;&#x548C;&#x53BB;&#x91CD;&#x590D;&#x5B9E;&#x4F53;&#x3002; &#x5B83;&#x4EEC;&#x63D0;&#x4F9B;&#x547D;&#x540D;&#x7A7A;&#x95F4;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x67E5;&#x8BE2;/&#x6CBF;&#x88AD;&#x3002; &#x552F;&#x4E00;&#x7684;&#x5C5E;&#x6027;&#x662F;&#xFF1A;</p>
<ul>
<li>falcon_process - <process name="">@<cluster name=""></cluster></process></li>
<li>falcon_cluster - <cluster name=""></cluster></li>
<li>falcon_feed - <feed name="">@<cluster name=""></cluster></feed></li>
<li>falcon_feed_creation - <feed name=""></feed></li>
<li>falcon_feed_replication - <feed name=""></feed></li>
</ul>
<h3 id="falcon-hook">Falcon Hook</h3>
<p>Falcon &#x652F;&#x6301;&#x5728; falcon &#x5B9E;&#x4F53;&#x63D0;&#x4EA4;&#x4E0A;&#x7684;&#x4FA6;&#x542C;&#x5668;&#x3002; &#x8FD9;&#x7528;&#x4E8E;&#x5728; Atlas &#x4E2D;&#x4F7F;&#x7528; <code>org.apache.atlas.falcon.model.FalconDataModelGenerator</code> &#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x6A21;&#x578B;&#x6DFB;&#x52A0;&#x5B9E;&#x4F53;&#x3002; hook &#x5C06;&#x8BF7;&#x6C42;&#x63D0;&#x4EA4;&#x7ED9;&#x7EBF;&#x7A0B;&#x6C60;&#x6267;&#x884C;&#x5668;&#xFF0C;&#x4EE5;&#x907F;&#x514D;&#x963B;&#x585E;&#x547D;&#x4EE4;&#x6267;&#x884C;&#x3002; &#x7EBF;&#x7A0B;&#x5C06;&#x5B9E;&#x4F53;&#x4F5C;&#x4E3A;&#x6D88;&#x606F;&#x63D0;&#x4EA4;&#x7ED9;&#x901A;&#x77E5;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5E76;&#x4E14;&#x670D;&#x52A1;&#x5668;&#x8BFB;&#x53D6;&#x8FD9;&#x4E9B;&#x6D88;&#x606F;&#x5E76;&#x6CE8;&#x518C;&#x5B9E;&#x4F53;&#x3002;</p>
<ul>
<li>Add &apos;org.apache.atlas.falcon.service.AtlasService&apos; to application.services in <strong>${falcon-conf}/startup.properties</strong></li>
<li>Link falcon hook jars in falcon classpath - &apos;ln -s ${atlas-home}/hook/falcon/* ${falcon-home}/server/webapp/falcon/WEB-INF/lib/&apos;</li>
<li>In <strong>${falcon_conf}/falcon-env.sh</strong>, set an environment variable as follows:</li>
</ul>
<pre><code>export FALCON_SERVER_OPTS=&quot;&lt;atlas_home&gt;/hook/falcon/*:$FALCON_SERVER_OPTS&quot;
</code></pre><p>The following properties in <strong>${atlas-conf}/atlas-application.properties</strong> control the thread pool and notification details:</p>
<ul>
<li>atlas.hook.falcon.synchronous - boolean, true to run the hook synchronously. default false</li>
<li>atlas.hook.falcon.numRetries - number of retries for notification failure. default 3</li>
<li>atlas.hook.falcon.minThreads - core number of threads. default 5</li>
<li>atlas.hook.falcon.maxThreads - maximum number of threads. default 5</li>
<li>atlas.hook.falcon.keepAliveTime - keep alive time in msecs. default 10</li>
<li>atlas.hook.falcon.queueSize - queue size for the threadpool. default 10000</li>
</ul>
<p>Refer <a href="http://atlas.apache.org/Configuration.html" target="_blank">Configuration</a> for notification related configurations</p>
<h3 id="limitations">Limitations</h3>
<ul>
<li>&#x5728; falcon &#x96C6;&#x7FA4;&#x5B9E;&#x4F53;&#x4E2D;&#xFF0C;&#x4F7F;&#x7528;&#x7684;&#x96C6;&#x7FA4;&#x540D;&#x79F0;&#x5E94;&#x8BE5;&#x8DE8;&#x8BF8;&#x5982; hive&#xFF0C;falcon&#xFF0C;sqoop &#x7B49;&#x7EC4;&#x4EF6;&#x662F;&#x7EDF;&#x4E00;&#x7684;&#x3002;&#x5982;&#x679C;&#x4E0E; ambari &#x4E00;&#x8D77;&#x4F7F;&#x7528;&#xFF0C;&#x5219;&#x5E94;&#x8BE5;&#x4F7F;&#x7528; ambari &#x96C6;&#x7FA4;&#x540D;&#x79F0;&#x7528;&#x4E8E;&#x96C6;&#x7FA4;&#x5B9E;&#x4F53;</li>
</ul>
<h2 id="storm-atlas-bridge">Storm Atlas Bridge</h2>
<h3 id="introduction">Introduction</h3>
<p>Apache Storm &#x662F;&#x4E00;&#x4E2A;&#x5206;&#x5E03;&#x5F0F;&#x5B9E;&#x65F6;&#x8BA1;&#x7B97;&#x7CFB;&#x7EDF;&#x3002; Storm &#x4F7F;&#x5F97;&#x5BB9;&#x6613;&#x53EF;&#x9760;&#x5730;&#x5904;&#x7406;&#x65E0;&#x754C;&#x7684;&#x6570;&#x636E;&#x6D41;&#xFF0C;&#x4E3A;&#x5B9E;&#x65F6;&#x5904;&#x7406; Hadoop &#x5BF9;&#x6279;&#x5904;&#x7406;&#x6240;&#x505A;&#x7684;&#x5DE5;&#x4F5C;&#x3002; &#x8BE5;&#x8FC7;&#x7A0B;&#x5B9E;&#x8D28;&#x4E0A;&#x662F;&#x8282;&#x70B9;&#x7684; DAG&#xFF0C;&#x5176;&#x88AB;&#x79F0;&#x4E3A; <strong>topology</strong>&#x3002;</p>
<p>Apache Atlas &#x662F;&#x4E00;&#x4E2A;&#x5143;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x5E93;&#xFF0C;&#x652F;&#x6301;&#x7AEF;&#x5230;&#x7AEF;&#x6570;&#x636E;&#x6CBF;&#x88AD;&#xFF0C;&#x641C;&#x7D22;&#x548C;&#x5173;&#x8054;&#x4E1A;&#x52A1;&#x5206;&#x7C7B;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x96C6;&#x6210;&#x7684;&#x76EE;&#x7684;&#x662F;&#x63A8;&#x52A8;&#x64CD;&#x4F5C; topology &#x5143;&#x6570;&#x636E;&#x4EE5;&#x53CA;&#x57FA;&#x7840;&#x6570;&#x636E;&#x6E90;&#xFF0C;&#x76EE;&#x6807;&#xFF0C;&#x63A8;&#x5BFC;&#x8FC7;&#x7A0B;&#x548C;&#x4EFB;&#x4F55;&#x53EF;&#x7528;&#x7684;&#x4E1A;&#x52A1;&#x4E0A;&#x4E0B;&#x6587;&#xFF0C;&#x4EE5;&#x4FBF; Atlas &#x53EF;&#x4EE5;&#x6355;&#x83B7;&#x6B64; topology &#x7684; lineage&#x3002;</p>
<p>&#x5728;&#x6B64;&#x8FC7;&#x7A0B;&#x4E2D;&#x6709;2&#x4E2A;&#x90E8;&#x5206;&#x8BE6;&#x8FF0;&#x5982;&#x4E0B;&#xFF1A;</p>
<ul>
<li>Data model to represent the concepts in Storm</li>
<li>Storm Atlas Hook to update metadata in Atlas</li>
</ul>
<h3 id="storm-data-model">Storm Data Model</h3>
<p>&#x6570;&#x636E;&#x6A21;&#x578B;&#x5728; Atlas &#x4E2D;&#x8868;&#x793A;&#x4E3A; Types&#x3002; &#x5B83;&#x5305;&#x542B; topology &#x56FE;&#x4E2D;&#x5404;&#x79CD;&#x8282;&#x70B9;&#x7684;&#x63CF;&#x8FF0;&#xFF0C;&#x4F8B;&#x5982; spouts &#x548C; bolts  &#x4EE5;&#x53CA;&#x76F8;&#x5E94;&#x7684;&#x751F;&#x4EA7;&#x8005;&#x548C;&#x6D88;&#x8D39;&#x8005;&#x7C7B;&#x578B;&#x3002;</p>
<p>&#x5728;Atlas&#x4E2D;&#x6DFB;&#x52A0;&#x4EE5;&#x4E0B;&#x7C7B;&#x578B;&#x3002;</p>
<ul>
<li>storm_topology - &#x8868;&#x793A;&#x7C97;&#x7C92;&#x5EA6;&#x62D3;&#x6251;&#x3002;storm_topology &#x6765;&#x81EA;&#x4E8E; Atlas &#x8FC7;&#x7A0B;&#x7C7B;&#x578B;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x7528;&#x4E8E;&#x901A;&#x77E5; Atlas &#x5173;&#x4E8E; lineage&#x3002;</li>
<li>&#x6DFB;&#x52A0;&#x4EE5;&#x4E0B;&#x6570;&#x636E;&#x96C6; - kafka_topic&#xFF0C;jms_topic&#xFF0C;hbase_table&#xFF0C;hdfs_data_set&#x3002; &#x8FD9;&#x4E9B;&#x90FD;&#x6765;&#x81EA;Atlas Dataset&#x7C7B;&#x578B;&#xFF0C;&#x56E0;&#x6B64;&#x5F62;&#x6210;&#x8C31;&#x7CFB;&#x56FE;&#x7684;&#x7AEF;&#x70B9;&#x3002;</li>
<li>storm_spout - &#x5177;&#x6709;&#x8F93;&#x51FA;&#x7684;&#x6570;&#x636E;&#x751F;&#x4EA7;&#x8005;&#xFF0C;&#x901A;&#x5E38;&#x4E3A;Kafka&#xFF0C;JMS</li>
<li>storm_bolt - &#x5177;&#x6709;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x7684;&#x6570;&#x636E;&#x4F7F;&#x7528;&#x8005;&#xFF0C;&#x901A;&#x5E38;&#x4E3A;Hive&#xFF0C;HBase&#xFF0C;HDFS&#x7B49;&#x3002;</li>
</ul>
<p>Storm Atlas hook&#x81EA;&#x52A8;&#x6CE8;&#x518C;&#x4F9D;&#x8D56;&#x6A21;&#x578B;&#xFF0C;&#x5982;Hive&#x6570;&#x636E;&#x6A21;&#x578B;&#xFF0C;&#x5982;&#x679C;&#x5B83;&#x53D1;&#x73B0;&#x8FD9;&#x4E9B;&#x662F;&#x4E0D;&#x4E3A;Atlas&#x670D;&#x52A1;&#x5668;&#x6240;&#x77E5;&#x3002;</p>
<p>&#x6BCF;&#x4E2A;&#x7C7B;&#x578B;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#x5728;&#x7C7B;&#x5B9A;&#x4E49;org.apache.atlas.storm.model.StormDataModel&#x4E2D;&#x63CF;&#x8FF0;&#x3002;</p>
<h3 id="storm-atlas-hook">Storm Atlas Hook</h3>
<p>&#x5F53;&#x5728; Storm &#x4E2D;&#x6210;&#x529F;&#x6CE8;&#x518C;&#x65B0; topology &#x65F6;&#xFF0C;&#x901A;&#x77E5; Atlas&#x3002; Storm &#x5728; Storm &#x5BA2;&#x6237;&#x7AEF;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x94A9;&#x5B50;&#xFF0C;backtype.storm.ISubmitterHook&#xFF0C;&#x7528;&#x4E8E;&#x63D0;&#x4EA4;&#x4E00;&#x4E2A; Storm topology&#x3002;</p>
<p>Storm Atlas hook &#x62E6;&#x622A; hook &#x540E;&#x6267;&#x884C;&#xFF0C;&#x5E76;&#x4ECE; topology &#x4E2D;&#x63D0;&#x53D6;&#x5143;&#x6570;&#x636E;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x5B9A;&#x4E49;&#x7684;&#x7C7B;&#x578B;&#x66F4;&#x65B0; Atlas&#x3002; Atlas &#x5728;org.apache.atlas.storm.hook.StormAtlasHook &#x4E2D;&#x5B9E;&#x73B0;&#x4E86; Storm &#x5BA2;&#x6237;&#x7AEF; hook &#x63A5;&#x53E3;&#x3002;</p>
<h3 id="limitations">Limitations</h3>
<p>&#x4EE5;&#x4E0B;&#x5185;&#x5BB9;&#x9002;&#x7528;&#x4E8E;&#x96C6;&#x6210;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x7248;&#x672C;&#x3002;</p>
<ul>
<li>&#x53EA;&#x6709;&#x65B0;&#x7684; topology &#x63D0;&#x4EA4;&#x5DF2;&#x6CE8;&#x518C;&#x5230; Atlas&#xFF0C;&#x4EFB;&#x4F55;&#x751F;&#x547D;&#x5468;&#x671F;&#x53D8;&#x5316;&#x90FD;&#x4E0D;&#x4F1A;&#x53CD;&#x6620;&#x5728; Atlas &#x4E2D;&#x3002;</li>
<li>&#x5F53;&#x4E3A;&#x8981;&#x6355;&#x83B7;&#x7684;&#x5143;&#x6570;&#x636E;&#x63D0;&#x4EA4; Storm topology &#x65F6;&#xFF0C;Atlas &#x670D;&#x52A1;&#x5668;&#x9700;&#x8981;&#x5728;&#x7EBF;&#x3002;</li>
<li>hook &#x76EE;&#x524D;&#x4E0D;&#x652F;&#x6301;&#x6355;&#x83B7;&#x81EA;&#x5B9A;&#x4E49; spouts &#x548C; bolts &#x7684; lineage&#x3002;</li>
</ul>
<h3 id="installation">Installation</h3>
<p>Storm Atlas Hook &#x9700;&#x8981;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#x624B;&#x52A8;&#x5B89;&#x88C5;&#x5728; Storm &#x5728;&#xFF1A;$ATLAS_PACKAGE/hook/storm</p>
<p>Storm Atlas Hook &#x9700;&#x8981;&#x590D;&#x5236;&#x5230; $STORM_HOME/extlib&#x3002; &#x4F7F;&#x7528; storm &#x5B89;&#x88C5;&#x8DEF;&#x5F84;&#x66FF;&#x6362; STORM_HOME&#x3002;</p>
<p>&#x5728;&#x5C06;&#x5B89;&#x88C5;&#x4E86; atlas hook &#x5230; Storm &#x540E;&#x91CD;&#x65B0;&#x542F;&#x52A8;&#x6240;&#x6709;&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x3002;</p>
<h3 id="configuration">Configuration</h3>
<h4 id="storm-configuration">Storm Configuration</h4>
<p>Storm Atlas Hook &#x9700;&#x8981;&#x5728; Storm &#x5BA2;&#x6237;&#x7AEF; <strong>$STORM_HOME/conf/storm.yaml</strong> &#x8FDB;&#x884C;&#x914D;&#x7F6E;:</p>
<pre><code>storm.topology.submission.notifier.plugin.class: &quot;org.apache.atlas.storm.hook.StormAtlasHook&quot;
</code></pre><p>&#x8FD8;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A; &quot;&#x96C6;&#x7FA4;&#x540D;&#x79F0;&quot;&#xFF0C;&#x5C06;&#x7528;&#x4F5C;&#x5728; Atlas &#x4E2D;&#x6CE8;&#x518C;&#x7684;&#x5BF9;&#x8C61;&#x7684;&#x547D;&#x540D;&#x7A7A;&#x95F4;&#x3002; &#x6B64;&#x540D;&#x79F0;&#x5C06;&#x7528;&#x4E8E;&#x547D;&#x540D; Storm topology&#xFF0C;spouts &#x548C; bolts&#x3002;</p>
<p>&#x5176;&#x4ED6;&#x5BF9;&#x8C61;&#xFF08;&#x5982; Dataset&#xFF09;&#x5E94;&#x8BE5;&#x7406;&#x60F3;&#x5730;&#x7528;&#x751F;&#x6210;&#x5B83;&#x4EEC;&#x7684;&#x7EC4;&#x4EF6;&#x7684;&#x96C6;&#x7FA4;&#x540D;&#x79F0;&#x6765;&#x6807;&#x8BC6;&#x3002; &#x4F8B;&#x5982;&#xFF0C; Hive &#x8868;&#x548C;&#x6570;&#x636E;&#x5E93;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;&#x5728; Hive &#x4E2D;&#x8BBE;&#x7F6E;&#x7684;&#x96C6;&#x7FA4;&#x540D;&#x79F0;&#x6765;&#x6807;&#x8BC6;&#x3002; &#x5982;&#x679C; Hive &#x914D;&#x7F6E;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#x4E0A;&#x63D0;&#x4EA4;&#x7684; Storm topology jar &#x4E2D;&#x53EF;&#x7528;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x90A3;&#x91CC;&#x5B9A;&#x4E49;&#x4E86;&#x96C6;&#x7FA4;&#x540D;&#x79F0;&#xFF0C;Storm Atlas hook &#x5C06;&#x9009;&#x62E9;&#x6B64;&#x9009;&#x9879;&#x3002; &#x5BF9;&#x4E8E; HBase &#x6570;&#x636E;&#x96C6;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x7C7B;&#x4F3C;&#x3002; &#x5982;&#x679C;&#x6B64;&#x914D;&#x7F6E;&#x4E0D;&#x53EF;&#x7528;&#xFF0C;&#x5C06;&#x4F7F;&#x7528;&#x5728; Storm &#x914D;&#x7F6E;&#x4E2D;&#x8BBE;&#x7F6E;&#x7684;&#x96C6;&#x7FA4;&#x540D;&#x79F0;&#x3002;</p>
<pre><code>atlas.cluster.name: &quot;cluster_name&quot;
</code></pre><p>&#x5728; <strong>$STORM_HOME/conf/storm_env.ini</strong> &#x4E2D;, &#x8BBE;&#x7F6E;&#x4EE5;&#x4E0B;&#x73AF;&#x5883;&#x53D8;&#x91CF;:</p>
<pre><code>STORM_JAR_JVM_OPTS:&quot;-Datlas.conf=$ATLAS_HOME/conf/&quot;
</code></pre><p>&#x5C06; ATLAS_HOME &#x6307;&#x5411; ATLAS &#x7684;&#x5B89;&#x88C5;&#x76EE;&#x5F55;.</p>
<p>&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7A0B;&#x5E8F;&#x5BF9; Storm &#x8FDB;&#x884C;&#x5982;&#x4E0B;&#x914D;&#x7F6E;:</p>
<pre><code>Config stormConf = new Config();
...
stormConf.put(Config.STORM_TOPOLOGY_SUBMISSION_NOTIFIER_PLUGIN,
org.apache.atlas.storm.hook.StormAtlasHook.class.getName());
</code></pre>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../zeppelin/zeppelin 中运行 spark streaming kakfa 实时可视化.html" class="navigation navigation-prev " aria-label="Previous page: zeppelin 中运行 spark streaming kakfa 实时可视化">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../FastDCS/FastDCS-introduction.html" class="navigation navigation-next " aria-label="Next page: FastDCS-分布式计算系统介绍">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"Apache-Atlas-数据治理","level":"1.3","depth":1,"next":{"title":"FastDCS-分布式计算系统介绍","level":"1.4","depth":1,"path":"FastDCS/FastDCS-introduction.md","ref":"FastDCS/FastDCS-introduction.md","articles":[{"title":"FastDCS-架构介绍","level":"1.4.1","depth":2,"path":"FastDCS/FastDCS 架构介绍.md","ref":"FastDCS/FastDCS 架构介绍.md","articles":[]},{"title":"FastDCS-开发实例","level":"1.4.2","depth":2,"path":"FastDCS/FastDCS 开发实例.md","ref":"FastDCS/FastDCS 开发实例.md","articles":[]},{"title":"FastDCS 开发说明","level":"1.4.3","depth":2,"path":"FastDCS/FastDCS 开发说明.md","ref":"FastDCS/FastDCS 开发说明.md","articles":[]}]},"previous":{"title":"zeppelin 中运行 spark streaming kakfa 实时可视化","level":"1.2.3","depth":2,"path":"zeppelin/zeppelin 中运行 spark streaming kakfa 实时可视化.md","ref":"zeppelin/zeppelin 中运行 spark streaming kakfa 实时可视化.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"Atlas/Apache Atlas 数据治理.md","mtime":"2018-05-11T09:06:49.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-05-11T09:46:21.205Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

